dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/sdk/platform/include/da14585_586.h

#ifndef _IODA14585_INCLUDED
#define _IODA14585_INCLUDED

// -------------------------------------------------------------------------------------
//
// Copyright  (C) 2016-2017 Dialog Semiconductor.
// This computer program includes Confidential, Proprietary Information
// of Dialog Semiconductor. All Rights Reserved.
//
// -------------------------------------------------------------------------------------
// C Source
// -------------------------------------------------------------------------------------
//
// Project         : $Aliases: DA14585Afpga $
// Date            : $Date: Tue Oct 18 13:06:56 2016 $
// Revision        : $Revision: 1.10 $
// Original Author : <initial major contributor(s) to this code, not usually changed>
// Last Changed By : $Author: jsifnaio $
// Source          : $Source: /sync/8000/syncdata/db-rs.diasemi.com/8000/server_vault/bb/DA14585/development/layout/fpga/datasheet.h.rca $
//
// -------------------------------------------------------------------------------------
//
// Description: "DA14585.int.h" (Datasheet #2087)
//              C header file of the device registers and bit fields
//              Generated by DoxBox on Oct 04, 2016 11:28:56
//              Target audience: Dialog internal
//
// -------------------------------------------------------------------------------------
//
// Synchronicity history:
//
// $Log: datasheet.h.rca $
// 
//  Revision: 1.10 Tue Oct 18 13:06:56 2016 jsifnaio
//  tape out version
// 
//  Revision: 1.29 Tue Oct  4 11:48:50 2016 hsnijder
//  Changed 'RF_DIAG' into 'BLE_RF_DIAG' (like in the documented DS and in the 580).
//
// -------------------------------------------------------------------------------------
#include <stdint.h>


/*===========================================================================*/ 
/*========================== Start of header part ===========================*/ 
/*===========================================================================*/ 
/*
* =============================================================================================
* ---------- Interrupt ReQuest number definitions ---------------------------------------------
* =============================================================================================
*/

/*
* --------------------------------------------------------------------------------------------
* The Cortex-M0 Processor Exceptions Numbers and the Device Specific Interrupt Numbers. -
* --------------------------------------------------------------------------------------------
*/
typedef enum IRQn
{
/****** Cortex-M0 Processor Exceptions Numbers ***********************************************/
NonMaskableInt_IRQn  = -14, /* 2 Non Maskable Interrupt */
HardFault_IRQn       = -13, /* 3 Cortex-M0 Hard Fault Interrupt */
SVCall_IRQn          = -5,  /* 11 Cortex-M0 SV Call Interrupt */
PendSV_IRQn          = -2,  /* 14 Cortex-M0 Pend SV Interrupt */
SysTick_IRQn         = -1,  /* 15 Cortex-M0 System Tick Interrupt */

/****** DA14585 Specific Interrupt Numbers ****************************************************/
BLE_WAKEUP_LP_IRQn   =  0, /* Wakeup from Low Power interrupt from BLE.                       */
BLE_GEN_IRQn         =  1, /* BLE Interrupt request. Sources:                                 */
                           /*   - finetgtim_irq  : Fine Target Timer interrupt generated when */
                           /*                      Fine Target timer expired. Timer           */
                           /*                      resolution is 625us base time reference.   */
                           /*   - grosstgtim_irq : Gross Target Timer interrupt generated     */
                           /*                      when Gross Target timer expired. Timer     */
                           /*                      resolution is 16 times 625us base time     */
                           /*                      reference.                                 */
                           /*   - cscnt_irq      : 625us base time reference interrupt,       */
                           /*                      available in active modes.                 */
                           /*   - slp_irq        : End of Sleep mode interrupt.               */
                           /*   - error_irq      : Error interrupt, generated when undesired  */
                           /*                      behavior or bad programming occurs in the  */
                           /*                      BLE Core.                                  */
                           /*   - rx_irq         : Receipt interrupt at the end of each       */
                           /*                      received packets.                          */
                           /*   - event_irq      : End of Advertising / Scanning / Connection */
                           /*                      events interrupt.                          */
                           /*   - crypt_irq      : Encryption / Decryption interrupt,         */
                           /*                      generated either when AES and/or CCM       */
                           /*                      processing is finished.                    */
                           /*   - sw_irq         : SW triggered interrupt, generated on SW    */
                           /*                      request.                                   */
UART_IRQn            =  2, /* UART interrupt.                                                 */
UART2_IRQn           =  3, /* UART2 interrupt.                                                */
I2C_IRQn             =  4, /* I2C interrupt.                                                  */
SPI_IRQn             =  5, /* SPI interrupt.                                                  */
ADC_IRQn             =  6, /* Analog-Digital Converter interrupt.                             */
KEYBRD_IRQn          =  7, /* Keyboard interrupt.                                             */
BLE_RF_DIAG_IRQn     =  8, /* Baseband or Radio Diagnostics Interrupt. Required for signaling */
                           /* Radio or Baseband internal events.                              */
                           /* 2 signals per Radio and 2 per BB                                */
RFCAL_IRQn           =  9, /* Radio Calibration interrupt.                                    */
GPIO0_IRQn           = 10, /* GPIO interrupt through debounce.                                */
GPIO1_IRQn           = 11, /* GPIO interrupt through debounce.                                */
GPIO2_IRQn           = 12, /* GPIO interrupt through debounce.                                */
GPIO3_IRQn           = 13, /* GPIO interrupt through debounce.                                */
GPIO4_IRQn           = 14, /* GPIO interrupt through debounce.                                */
SWTIM_IRQn           = 15, /* Software Timer (Timer0) interrupt.                              */
WKUP_QUADEC_IRQn     = 16, /* Combines the Wake up Capture Timer interrupt,                   */
                           /* the GPIO interrupt and the QuadDecoder interrupt                */
PCM_IRQn             = 17, /* PCM Interrupt request.                                          */
SRC_IN_IRQn          = 18, /* Sample Rate Converter Input Interrupt request.                  */
SRC_OUT_IRQn         = 19, /* Sample Rate Converter Output Interrupt request.                 */
DMA_IRQn             = 20, /* DMA Interrupt request.                                          */
RESERVED21_IRQn      = 21, /* SoftWare interrupt request.                                     */
RESERVED22_IRQn      = 22, /* SoftWare interrupt request.                                     */
RESERVED23_IRQn      = 23, /* SoftWare interrupt request                                      */
} IRQn_Type;


/*--------------------------------------------------------------------------------------------*/
/* Configuration of the Cortex-M0 Processor and Core Peripherals.                             */
/*--------------------------------------------------------------------------------------------*/
/* Note: The next 2 defines are used in "core_cm0.h" for the CMSIS Core SysTick function.     */
#define __NVIC_PRIO_BITS       (2) /* Number of Bits used for Priority Levels                 */
#define __Vendor_SysTickConfig (0) /* Set to 1 if different SysTick Config is used            */

/*--GPIO PID functions------------------------------------------------------------------------*/
#define FUNC_GPIO          ( 0)
#define FUNC_UART_RX       ( 1)
#define FUNC_UART_TX       ( 2)
#define FUNC_UART2_RX      ( 3)
#define FUNC_UART2_TX      ( 4)
#define FUNC_SPI_DI        ( 5)
#define FUNC_SPI_DO        ( 6)
#define FUNC_SPI_CLK       ( 7)
#define FUNC_SPI_EN        ( 8)
#define FUNC_I2C_SCL       ( 9)
#define FUNC_I2C_SDA       (10)
#define FUNC_UART_IRDA_RX  (11)
#define FUNC_UART_IRDA_TX  (12)
#define FUNC_UART2_IRDA_RX (13)
#define FUNC_UART2_IRDA_TX (14)
#define FUNC_ADC           (15)
#define FUNC_PWM0          (16)
#define FUNC_PWM1          (17)
#define FUNC_BLE_DIAG      (18)
#define FUNC_UART_CTSN     (19)
#define FUNC_UART_RTSN     (20)
#define FUNC_UART2_CTSN    (21)
#define FUNC_UART2_RTSN    (22)
#define FUNC_PWM2          (23)
#define FUNC_PWM3          (24)
#define FUNC_PWM4          (25)
#define FUNC_PCM_DI        (26)
#define FUNC_PCM_DO        (27)
#define FUNC_PCM_FSC       (28)
#define FUNC_PCM_CLK       (29)
#define FUNC_PDM_DATA      (30)
#define FUNC_PDM_CLK       (31)
/*--GPIO Direction settings------------------------------------------------------------------*/
#define DIR_INPUT          0x000
#define DIR_PULLUP         0x100
#define DIR_PULLDOWN       0x200
#define DIR_OUTPUT         0x300


/*===========================================================================*/ 
/*=========================== End of header part ============================*/ 
/*===========================================================================*/ 



/*===========================================================================*/ 
/*==================== Start of automatic generated code ====================*/ 
/*===========================================================================*/ 



/*===========================================================================*/
/* memory map ANAMISC */
/*===========================================================================*/



#define CLK_REF_SEL_REG                      (0x50001600) /* Select clock for oscillator calibration */
#define CLK_REF_SEL_REG_RESET                (0x00000000)

/*=============================*/
struct __CLK_REF_SEL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_REF_CLK_SEL                      : 2;
    volatile uint16_t BITFLD_REF_CAL_START                    : 1;
};
#define REF_CLK_SEL                          (0x0003)
#define REF_CAL_START                        (0x0004)



