dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/sdk/platform/include/da14585_586.h
#define CLK_REF_CNT_REG                      (0x50001602) /* Count value for oscillator calibration */
#define CLK_REF_CNT_REG_RESET                (0x00000000)

/*=============================*/
struct __CLK_REF_CNT_REG
/*=============================*/
{
    volatile uint16_t BITFLD_REF_CNT_VAL                      : 16;
};
#define REF_CNT_VAL                          (0xFFFF)



#define CLK_REF_VAL_L_REG                    (0x50001604) /* XTAL16M reference cycles, lower 16 bits */
#define CLK_REF_VAL_L_REG_RESET              (0x00000000)

/*=============================*/
struct __CLK_REF_VAL_L_REG
/*=============================*/
{
    volatile uint16_t BITFLD_XTAL_CNT_VAL                     : 16;
};
#define XTAL_CNT_VAL                         (0xFFFF)



#define CLK_REF_VAL_H_REG                    (0x50001606) /* XTAL16M reference cycles, upper 16 bits */
#define CLK_REF_VAL_H_REG_RESET              (0x00000000)

/*=============================*/
struct __CLK_REF_VAL_H_REG
/*=============================*/
{
    volatile uint16_t BITFLD_XTAL_CNT_VAL                     : 16;
};
#define XTAL_CNT_VAL                         (0xFFFF)



/*===========================================================================*/
/* memory map APU */
/*===========================================================================*/



#define SRC1_CTRL_REG                        (0x50004000) /* SRC1 control register */
#define SRC1_CTRL_REG_RESET                  (0x00000000)

/*=============================*/
struct __SRC1_CTRL_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SRC_EN                           : 1;
    volatile uint32_t BITFLD_SRC_IN_AMODE                     : 1;
    volatile uint32_t BITFLD_SRC_IN_CAL_BYPASS                : 1;
    volatile uint32_t                                         : 1;
    volatile uint32_t BITFLD_SRC_IN_DS                        : 2;
    volatile uint32_t BITFLD_SRC_IN_OK                        : 1;
    volatile uint32_t BITFLD_SRC_DITHER_DISABLE               : 1;
    volatile uint32_t                                         : 2;
    volatile uint32_t                                         : 3;
    volatile uint32_t BITFLD_SRC_OUT_AMODE                    : 1;
    volatile uint32_t BITFLD_SRC_OUT_CAL_BYPASS               : 1;
    volatile uint32_t                                         : 1;
    volatile uint32_t BITFLD_SRC_OUT_US                       : 2;
    volatile uint32_t BITFLD_SRC_OUT_OK                       : 1;
    volatile uint32_t BITFLD_SRC_RESYNC                       : 1;
    volatile uint32_t BITFLD_SRC_IN_OVFLOW                    : 1;
    volatile uint32_t BITFLD_SRC_IN_UNFLOW                    : 1;
    volatile uint32_t BITFLD_SRC_OUT_OVFLOW                   : 1;
    volatile uint32_t BITFLD_SRC_OUT_UNFLOW                   : 1;
    volatile uint32_t BITFLD_SRC_IN_FLOWCLR                   : 1;
    volatile uint32_t BITFLD_SRC_OUT_FLOWCLR                  : 1;
    volatile uint32_t BITFLD_SRC_PDM_DI_DEL                   : 2;
    volatile uint32_t BITFLD_SRC_PDM_MODE                     : 2;
    volatile uint32_t BITFLD_SRC_PDM_DO_DEL                   : 2;
};
#define SRC_EN                               (0x0001)
#define SRC_IN_AMODE                         (0x0002)
#define SRC_IN_CAL_BYPASS                    (0x0004)
#define SRC_IN_DS                            (0x0030)
#define SRC_IN_OK                            (0x0040)
#define SRC_DITHER_DISABLE                   (0x0080)
#define SRC_OUT_AMODE                        (0x2000)
#define SRC_OUT_CAL_BYPASS                   (0x4000)
#define SRC_OUT_US                           (0x30000)
#define SRC_OUT_OK                           (0x40000)
#define SRC_RESYNC                           (0x80000)
#define SRC_IN_OVFLOW                        (0x100000)
#define SRC_IN_UNFLOW                        (0x200000)
#define SRC_OUT_OVFLOW                       (0x400000)
#define SRC_OUT_UNFLOW                       (0x800000)
#define SRC_IN_FLOWCLR                       (0x1000000)
#define SRC_OUT_FLOWCLR                      (0x2000000)
#define SRC_PDM_DI_DEL                       (0xC000000)
#define SRC_PDM_MODE                         (0x30000000)
#define SRC_PDM_DO_DEL                       (0xC0000000)



#define SRC1_IN_FS_REG                       (0x50004004) /* SRC1 Sample input rate */
#define SRC1_IN_FS_REG_RESET                 (0x00000000)

/*=============================*/
struct __SRC1_IN_FS_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SRC_IN_FS                        : 24;
};
#define SRC_IN_FS                            (0xFFFFFF)



#define SRC1_OUT_FS_REG                      (0x50004008) /* SRC1 Sample output rate */
#define SRC1_OUT_FS_REG_RESET                (0x00000000)

/*=============================*/
struct __SRC1_OUT_FS_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SRC_OUT_FS                       : 24;
};
#define SRC_OUT_FS                           (0xFFFFFF)



#define SRC1_IN1_REG                         (0x5000400C) /* SRC1 data in 1 */
#define SRC1_IN1_REG_RESET                   (0x00000000)

/*=============================*/
struct __SRC1_IN1_REG
/*=============================*/
{
    volatile uint32_t                                         : 8;
    volatile uint32_t BITFLD_SRC_IN                           : 24;
};
#define SRC_IN                               (0xFFFFFF00)



#define SRC1_IN2_REG                         (0x50004010) /* SRC1 data in 2 */
#define SRC1_IN2_REG_RESET                   (0x00000000)

/*=============================*/
struct __SRC1_IN2_REG
/*=============================*/
{
    volatile uint32_t                                         : 8;
    volatile uint32_t BITFLD_SRC_IN                           : 24;
};
#define SRC_IN                               (0xFFFFFF00)



#define SRC1_OUT1_REG                        (0x50004014) /* SRC1 data out 1 */
#define SRC1_OUT1_REG_RESET                  (0x00000000)

/*=============================*/
struct __SRC1_OUT1_REG
/*=============================*/
{
    volatile uint32_t                                         : 8;
    volatile uint32_t BITFLD_SRC_OUT                          : 24;
};
