dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/sdk/platform/include/da14585_586.h
#define SRC_OUT                              (0xFFFFFF00)



#define SRC1_OUT2_REG                        (0x50004018) /* SRC1 data out 2 */
#define SRC1_OUT2_REG_RESET                  (0x00000000)

/*=============================*/
struct __SRC1_OUT2_REG
/*=============================*/
{
    volatile uint32_t                                         : 8;
    volatile uint32_t BITFLD_SRC_OUT                          : 24;
};
#define SRC_OUT                              (0xFFFFFF00)



#define APU_MUX_REG                          (0x5000401C) /* APU mux register */
#define APU_MUX_REG_RESET                    (0x00000000)

/*=============================*/
struct __APU_MUX_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SRC1_MUX_IN                      : 3;
    volatile uint32_t BITFLD_PCM1_MUX_IN                      : 3;
    volatile uint32_t BITFLD_PDM1_MUX_IN                      : 1;
};
#define SRC1_MUX_IN                          (0x0007)
#define PCM1_MUX_IN                          (0x0038)
#define PDM1_MUX_IN                          (0x0040)



#define COEF10_SET1_REG                      (0x50004020) /* SRC coefficient 1,0 set 1 */
#define COEF10_SET1_REG_RESET                (0x79A99278)

/*=============================*/
struct __COEF10_SET1_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SRC_COEF0                        : 16;
    volatile uint32_t BITFLD_SRC_COEF1                        : 16;
};
#define SRC_COEF0                            (0xFFFF)
#define SRC_COEF1                            (0xFFFF0000)



#define COEF32_SET1_REG                      (0x50004024) /* SRC coefficient 3,2 set 1 */
#define COEF32_SET1_REG_RESET                (0x6D568B41)

/*=============================*/
struct __COEF32_SET1_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SRC_COEF2                        : 16;
    volatile uint32_t BITFLD_SRC_COEF3                        : 16;
};
#define SRC_COEF2                            (0xFFFF)
#define SRC_COEF3                            (0xFFFF0000)



#define COEF54_SET1_REG                      (0x50004028) /* SRC coefficient 5,4 set 1 */
#define COEF54_SET1_REG_RESET                (0x9BC5BE15)

/*=============================*/
struct __COEF54_SET1_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SRC_COEF4                        : 16;
    volatile uint32_t BITFLD_SRC_COEF5                        : 16;
};
#define SRC_COEF4                            (0xFFFF)
#define SRC_COEF5                            (0xFFFF0000)



#define COEF76_SET1_REG                      (0x5000402C) /* SRC coefficient 7,6 set 1 */
#define COEF76_SET1_REG_RESET                (0x8C287E1A)

/*=============================*/
struct __COEF76_SET1_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SRC_COEF6                        : 16;
    volatile uint32_t BITFLD_SRC_COEF7                        : 16;
};
#define SRC_COEF6                            (0xFFFF)
#define SRC_COEF7                            (0xFFFF0000)



#define COEF98_SET1_REG                      (0x50004030) /* SRC coefficient 9,8 set 1 */
#define COEF98_SET1_REG_RESET                (0x92D775E6)

/*=============================*/
struct __COEF98_SET1_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SRC_COEF8                        : 16;
    volatile uint32_t BITFLD_SRC_COEF9                        : 16;
};
#define SRC_COEF8                            (0xFFFF)
#define SRC_COEF9                            (0xFFFF0000)



#define COEF0A_SET1_REG                      (0x50004034) /* SRC coefficient 10 set 1 */
#define COEF0A_SET1_REG_RESET                (0x000041F2)

/*=============================*/
struct __COEF0A_SET1_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SRC_COEF10                       : 16;
};
#define SRC_COEF10                           (0xFFFF)



#define PCM1_CTRL_REG                        (0x50004100) /* PCM1 Control register */
#define PCM1_CTRL_REG_RESET                  (0x00000000)

/*=============================*/
struct __PCM1_CTRL_REG
/*=============================*/
{
    volatile uint32_t BITFLD_PCM_EN                           : 1;
    volatile uint32_t BITFLD_PCM_MASTER                       : 1;
    volatile uint32_t BITFLD_PCM_FSCLEN                       : 4;
    volatile uint32_t BITFLD_PCM_FSCDEL                       : 1;
    volatile uint32_t BITFLD_PCM_PPOD                         : 1;
    volatile uint32_t BITFLD_PCM_CLKINV                       : 1;
    volatile uint32_t BITFLD_PCM_FSCINV                       : 1;
    volatile uint32_t BITFLD_PCM_CLK_BIT                      : 1;
    volatile uint32_t BITFLD_PCM_CH_DEL                       : 5;
    volatile uint32_t BITFLD_PCM_FSC_EDGE                     : 1;
    volatile uint32_t                                         : 3;
    volatile uint32_t BITFLD_PCM_FSC_DIV                      : 12;
};
#define PCM_EN                               (0x0001)
#define PCM_MASTER                           (0x0002)
#define PCM_FSCLEN                           (0x003C)
#define PCM_FSCDEL                           (0x0040)
#define PCM_PPOD                             (0x0080)
#define PCM_CLKINV                           (0x0100)
#define PCM_FSCINV                           (0x0200)
#define PCM_CLK_BIT                          (0x0400)
#define PCM_CH_DEL                           (0xF800)
#define PCM_FSC_EDGE                         (0x10000)
#define PCM_FSC_DIV                          (0xFFF00000)



#define PCM1_IN1_REG                         (0x50004104) /* PCM1 data in 1 */
#define PCM1_IN1_REG_RESET                   (0x00000000)

/*=============================*/
struct __PCM1_IN1_REG
/*=============================*/
{
    volatile uint32_t BITFLD_PCM_IN                           : 32;
};
#define PCM_IN                               (0xFFFFFFFF)



#define PCM1_IN2_REG                         (0x50004108) /* PCM1 data in 2 */
#define PCM1_IN2_REG_RESET                   (0x00000000)

/*=============================*/
struct __PCM1_IN2_REG
/*=============================*/
{
    volatile uint32_t BITFLD_PCM_IN                           : 32;
};
#define PCM_IN                               (0xFFFFFFFF)



#define PCM1_OUT1_REG                        (0x5000410C) /* PCM1 data out 1 */
#define PCM1_OUT1_REG_RESET                  (0xFFFFFFFF)

/*=============================*/
struct __PCM1_OUT1_REG
/*=============================*/
{
    volatile uint32_t BITFLD_PCM_OUT                          : 32;
};
#define PCM_OUT                              (0xFFFFFFFF)



#define PCM1_OUT2_REG                        (0x50004110) /* PCM1 data out 2 */
#define PCM1_OUT2_REG_RESET                  (0xFFFFFFFF)

/*=============================*/
struct __PCM1_OUT2_REG
/*=============================*/
{
    volatile uint32_t BITFLD_PCM_OUT                          : 32;
};
#define PCM_OUT                              (0xFFFFFFFF)



/*===========================================================================*/
/* memory map BLE */
/*===========================================================================*/



