dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/sdk/platform/include/da14585_586.h
#define FINE_ADJ                             (0x00FF)
#define COARSE_ADJ                           (0x0700)



#define CLK_PER_REG                          (0x50000004) /* Peripheral divider register */
#define CLK_PER_REG_RESET                    (0x00000000)

/*=============================*/
struct __CLK_PER_REG
/*=============================*/
{
    volatile uint16_t BITFLD_TMR_DIV                          : 2;
    volatile uint16_t                                         : 1;
    volatile uint16_t BITFLD_TMR_ENABLE                       : 1;
    volatile uint16_t BITFLD_WAKEUPCT_ENABLE                  : 1;
    volatile uint16_t BITFLD_I2C_ENABLE                       : 1;
    volatile uint16_t BITFLD_UART2_ENABLE                     : 1;
    volatile uint16_t BITFLD_UART1_ENABLE                     : 1;
    volatile uint16_t BITFLD_SPI_DIV                          : 2;
    volatile uint16_t                                         : 1;
    volatile uint16_t BITFLD_SPI_ENABLE                       : 1;
    volatile uint16_t                                         : 3;
    volatile uint16_t BITFLD_QUAD_ENABLE                      : 1;
};
#define TMR_DIV                              (0x0003)
#define TMR_ENABLE                           (0x0008)
#define WAKEUPCT_ENABLE                      (0x0010)
#define I2C_ENABLE                           (0x0020)
#define UART2_ENABLE                         (0x0040)
#define UART1_ENABLE                         (0x0080)
#define SPI_DIV                              (0x0300)
#define SPI_ENABLE                           (0x0800)
#define QUAD_ENABLE                          (0x8000)



#define CLK_RADIO_REG                        (0x50000008) /* Radio PLL control register */
#define CLK_RADIO_REG_RESET                  (0x00000040)

/*=============================*/
struct __CLK_RADIO_REG
/*=============================*/
{
    volatile uint16_t BITFLD_RFCU_DIV                         : 2;
    volatile uint16_t                                         : 1;
    volatile uint16_t BITFLD_RFCU_ENABLE                      : 1;
    volatile uint16_t BITFLD_BLE_DIV                          : 2;
    volatile uint16_t BITFLD_BLE_LP_RESET                     : 1;
    volatile uint16_t BITFLD_BLE_ENABLE                       : 1;
};
#define RFCU_DIV                             (0x0003)
#define RFCU_ENABLE                          (0x0008)
#define BLE_DIV                              (0x0030)
#define BLE_LP_RESET                         (0x0040)
#define BLE_ENABLE                           (0x0080)



#define CLK_CTRL_REG                         (0x5000000A) /* Clock control register */
#define CLK_CTRL_REG_RESET                   (0x00000080)

/*=============================*/
struct __CLK_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_SYS_CLK_SEL                      : 2;
    volatile uint16_t BITFLD_XTAL16M_DISABLE                  : 1;
    volatile uint16_t BITFLD_XTAL16M_SPIKE_FLT_DISABLE        : 1;
    volatile uint16_t                                         : 1;
    volatile uint16_t BITFLD_RUNNING_AT_32K                   : 1;
    volatile uint16_t BITFLD_RUNNING_AT_RC16M                 : 1;
    volatile uint16_t BITFLD_RUNNING_AT_XTAL16M               : 1;
};
#define SYS_CLK_SEL                          (0x0003)
#define XTAL16M_DISABLE                      (0x0004)
#define XTAL16M_SPIKE_FLT_DISABLE            (0x0008)
#define RUNNING_AT_32K                       (0x0020)
#define RUNNING_AT_RC16M                     (0x0040)
#define RUNNING_AT_XTAL16M                   (0x0080)



#define PMU_CTRL_REG                         (0x50000010) /* Power Management Unit control register */
#define PMU_CTRL_REG_RESET                   (0x00000006)

/*=============================*/
struct __PMU_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_RESET_ON_WAKEUP                  : 1;
    volatile uint16_t BITFLD_PERIPH_SLEEP                     : 1;
    volatile uint16_t BITFLD_RADIO_SLEEP                      : 1;
    volatile uint16_t                                         : 1;
    volatile uint16_t BITFLD_OTP_COPY_DIV                     : 2;
    volatile uint16_t BITFLD_FORCE_BUCK                       : 1;
    volatile uint16_t BITFLD_FORCE_BOOST                      : 1;
    volatile uint16_t BITFLD_RETENTION_MODE                   : 4;
};
#define RESET_ON_WAKEUP                      (0x0001)
#define PERIPH_SLEEP                         (0x0002)
#define RADIO_SLEEP                          (0x0004)
#define OTP_COPY_DIV                         (0x0030)
#define FORCE_BUCK                           (0x0040)
#define FORCE_BOOST                          (0x0080)
#define RETENTION_MODE                       (0x0F00)



#define SYS_CTRL_REG                         (0x50000012) /* System Control register */
#define SYS_CTRL_REG_RESET                   (0x00000020)

/*=============================*/
struct __SYS_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_REMAP_ADR0                       : 2;
    volatile uint16_t BITFLD_DEV_PHASE                        : 1;
    volatile uint16_t BITFLD_CLK32_SOURCE                     : 1;
    volatile uint16_t BITFLD_OTP_COPY                         : 1;
    volatile uint16_t BITFLD_PAD_LATCH_EN                     : 1;
    volatile uint16_t BITFLD_OTPC_RESET_REQ                   : 1;
    volatile uint16_t BITFLD_DEBUGGER_ENABLE                  : 1;
    volatile uint16_t                                         : 1;
    volatile uint16_t BITFLD_TIMEOUT_DISABLE                  : 1;
    volatile uint16_t                                         : 5;
    volatile uint16_t BITFLD_SW_RESET                         : 1;
};
#define REMAP_ADR0                           (0x0003)
#define DEV_PHASE                            (0x0004)
#define CLK32_SOURCE                         (0x0008)
#define OTP_COPY                             (0x0010)
#define PAD_LATCH_EN                         (0x0020)
#define OTPC_RESET_REQ                       (0x0040)
#define DEBUGGER_ENABLE                      (0x0080)
#define TIMEOUT_DISABLE                      (0x0200)
#define SW_RESET                             (0x8000)



#define SYS_STAT_REG                         (0x50000014) /* System status register */
#define SYS_STAT_REG_RESET                   (0x00000055)

/*=============================*/
struct __SYS_STAT_REG
/*=============================*/
{
    volatile uint16_t BITFLD_RAD_IS_DOWN                      : 1;
    volatile uint16_t BITFLD_RAD_IS_UP                        : 1;
    volatile uint16_t BITFLD_PER_IS_DOWN                      : 1;
    volatile uint16_t BITFLD_PER_IS_UP                        : 1;
    volatile uint16_t BITFLD_DBG_IS_DOWN                      : 1;
    volatile uint16_t BITFLD_DBG_IS_UP                        : 1;
    volatile uint16_t BITFLD_XTAL16_TRIM_READY                : 1;
    volatile uint16_t BITFLD_XTAL16_SETTLED                   : 1;
};
#define RAD_IS_DOWN                          (0x0001)
#define RAD_IS_UP                            (0x0002)
#define PER_IS_DOWN                          (0x0004)
#define PER_IS_UP                            (0x0008)
#define DBG_IS_DOWN                          (0x0010)
#define DBG_IS_UP                            (0x0020)
#define XTAL16_TRIM_READY                    (0x0040)
#define XTAL16_SETTLED                       (0x0080)



#define TRIM_CTRL_REG                        (0x50000016) /* Control trimming of the XTAL16M */
#define TRIM_CTRL_REG_RESET                  (0x000000A2)

/*=============================*/
struct __TRIM_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_SETTLE_TIME                      : 4;
    volatile uint16_t BITFLD_TRIM_TIME                        : 4;
};
#define SETTLE_TIME                          (0x000F)
#define TRIM_TIME                            (0x00F0)



