dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/sdk/platform/include/da14585_586.h
#define CLK_32K_REG                          (0x50000020) /* 32 kHz oscillator register */
#define CLK_32K_REG_RESET                    (0x000007AE)

/*=============================*/
struct __CLK_32K_REG
/*=============================*/
{
    volatile uint16_t BITFLD_XTAL32K_ENABLE                   : 1;
    volatile uint16_t BITFLD_XTAL32K_RBIAS                    : 2;
    volatile uint16_t BITFLD_XTAL32K_CUR                      : 4;
    volatile uint16_t BITFLD_RC32K_ENABLE                     : 1;
    volatile uint16_t BITFLD_RC32K_TRIM                       : 4;
    volatile uint16_t BITFLD_XTAL32K_DISABLE_AMPREG           : 1;
};
#define XTAL32K_ENABLE                       (0x0001)
#define XTAL32K_RBIAS                        (0x0006)
#define XTAL32K_CUR                          (0x0078)
#define RC32K_ENABLE                         (0x0080)
#define RC32K_TRIM                           (0x0F00)
#define XTAL32K_DISABLE_AMPREG               (0x1000)



#define CLK_16M_REG                          (0x50000022) /* 16 MHz RC-oscillator register */
#define CLK_16M_REG_RESET                    (0x000000A0)

/*=============================*/
struct __CLK_16M_REG
/*=============================*/
{
    volatile uint16_t BITFLD_RC16M_ENABLE                     : 1;
    volatile uint16_t BITFLD_RC16M_TRIM                       : 4;
    volatile uint16_t BITFLD_XTAL16_CUR_SET                   : 3;
    volatile uint16_t BITFLD_XTAL16_BIAS_SH_ENABLE            : 1;
    volatile uint16_t BITFLD_XTAL16_NOISE_FILT_ENABLE         : 1;
};
#define RC16M_ENABLE                         (0x0001)
#define RC16M_TRIM                           (0x001E)
#define XTAL16_CUR_SET                       (0x00E0)
#define XTAL16_BIAS_SH_ENABLE                (0x0100)
#define XTAL16_NOISE_FILT_ENABLE             (0x0200)



#define CLK_RCX20K_REG                       (0x50000024) /* 20 kHz RXC-oscillator control register */
#define CLK_RCX20K_REG_RESET                 (0x000005B0)

/*=============================*/
struct __CLK_RCX20K_REG
/*=============================*/
{
    volatile uint16_t BITFLD_RCX20K_TRIM                      : 4;
    volatile uint16_t BITFLD_RCX20K_NTC                       : 4;
    volatile uint16_t BITFLD_RCX20K_BIAS                      : 2;
    volatile uint16_t BITFLD_RCX20K_LOWF                      : 1;
    volatile uint16_t BITFLD_RCX20K_ENABLE                    : 1;
    volatile uint16_t BITFLD_RCX20K_SELECT                    : 1;
};
#define RCX20K_TRIM                          (0x000F)
#define RCX20K_NTC                           (0x00F0)
#define RCX20K_BIAS                          (0x0300)
#define RCX20K_LOWF                          (0x0400)
#define RCX20K_ENABLE                        (0x0800)
#define RCX20K_SELECT                        (0x1000)



#define BANDGAP_REG                          (0x50000028) /* Bandgap trimming */
#define BANDGAP_REG_RESET                    (0x00000000)

/*=============================*/
struct __BANDGAP_REG
/*=============================*/
{
    volatile uint16_t BITFLD_BGR_TRIM                         : 5;
    volatile uint16_t BITFLD_BGR_ITRIM                        : 5;
    volatile uint16_t BITFLD_LDO_RET_TRIM                     : 4;
    volatile uint16_t BITFLD_BGR_LOWPOWER                     : 1;
};
#define BGR_TRIM                             (0x001F)
#define BGR_ITRIM                            (0x03E0)
#define LDO_RET_TRIM                         (0x3C00)
#define BGR_LOWPOWER                         (0x4000)



#define ANA_STATUS_REG                       (0x5000002A) /* Status bit of analog (power management) circuits */
#define ANA_STATUS_REG_RESET                 (0x00000090)

/*=============================*/
struct __ANA_STATUS_REG
/*=============================*/
{
    volatile uint16_t BITFLD_VBAT1V_AVAILABLE                 : 1;
    volatile uint16_t BITFLD_VBAT1V_OK                        : 1;
    volatile uint16_t BITFLD_VDCDC_OK                         : 1;
    volatile uint16_t                                         : 1;
    volatile uint16_t BITFLD_LDO_VDD_OK                       : 1;
    volatile uint16_t BITFLD_LDO_ANA_OK                       : 1;
    volatile uint16_t BITFLD_BOOST_VBAT_OK                    : 1;
    volatile uint16_t BITFLD_BANDGAP_OK                       : 1;
    volatile uint16_t                                         : 1;
    volatile uint16_t BITFLD_BOOST_SELECTED                   : 1;
};
#define VBAT1V_AVAILABLE                     (0x0001)
#define VBAT1V_OK                            (0x0002)
#define VDCDC_OK                             (0x0004)
#define LDO_VDD_OK                           (0x0010)
#define LDO_ANA_OK                           (0x0020)
#define BOOST_VBAT_OK                        (0x0040)
#define BANDGAP_OK                           (0x0080)
#define BOOST_SELECTED                       (0x0200)



#define POR_PIN_REG                          (0x50000040) /* Selects a GPIO pin for POR generation */
#define POR_PIN_REG_RESET                    (0x00000000)

/*=============================*/
struct __POR_PIN_REG
/*=============================*/
{
    volatile uint16_t BITFLD_POR_PIN_SELECT                   : 6;
    volatile uint16_t                                         : 1;
    volatile uint16_t BITFLD_POR_PIN_POLARITY                 : 1;
};
#define POR_PIN_SELECT                       (0x003F)
#define POR_PIN_POLARITY                     (0x0080)



#define POR_TIMER_REG                        (0x50000042) /* Time for POR to happen */
#define POR_TIMER_REG_RESET                  (0x00000018)

/*=============================*/
struct __POR_TIMER_REG
/*=============================*/
{
    volatile uint16_t BITFLD_POR_TIME                         : 7;
};
#define POR_TIME                             (0x007F)



#define PCM_DIV_REG                          (0x50001C40) /* PCM divider and enables */
#define PCM_DIV_REG_RESET                    (0x00000000)

/*=============================*/
struct __PCM_DIV_REG
/*=============================*/
{
    volatile uint16_t BITFLD_PCM_DIV                          : 12;
    volatile uint16_t BITFLD_CLK_PCM_EN                       : 1;
    volatile uint16_t BITFLD_PCM_SRC_SEL                      : 1;
};
#define PCM_DIV                              (0x0FFF)
#define CLK_PCM_EN                           (0x1000)
#define PCM_SRC_SEL                          (0x2000)



#define PCM_FDIV_REG                         (0x50001C42) /* PCM fractional division register */
#define PCM_FDIV_REG_RESET                   (0x00000000)

/*=============================*/
struct __PCM_FDIV_REG
/*=============================*/
{
    volatile uint16_t BITFLD_PCM_FDIV                         : 16;
};
#define PCM_FDIV                             (0xFFFF)



#define PDM_DIV_REG                          (0x50001C44) /* PDM divider and enables */
#define PDM_DIV_REG_RESET                    (0x00000000)

/*=============================*/
struct __PDM_DIV_REG
/*=============================*/
{
    volatile uint16_t BITFLD_PDM_DIV                          : 8;
    volatile uint16_t BITFLD_CLK_PDM_EN                       : 1;
    volatile uint16_t BITFLD_PDM_MASTER_MODE                  : 1;
};
