dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/sdk/platform/include/da14585_586.h
#define DMA2_IDX                             (0xFFFF)



#define DMA3_A_STARTL_REG                    (0x50003630) /* Start address Low A of DMA channel 3 */
#define DMA3_A_STARTL_REG_RESET              (0x00000000)

/*=============================*/
struct __DMA3_A_STARTL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DMA3_A_STARTL                    : 16;
};
#define DMA3_A_STARTL                        (0xFFFF)



#define DMA3_A_STARTH_REG                    (0x50003632) /* Start address High A of DMA channel 3 */
#define DMA3_A_STARTH_REG_RESET              (0x00000000)

/*=============================*/
struct __DMA3_A_STARTH_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DMA3_A_STARTH                    : 16;
};
#define DMA3_A_STARTH                        (0xFFFF)



#define DMA3_B_STARTL_REG                    (0x50003634) /* Start address Low B of DMA channel 3 */
#define DMA3_B_STARTL_REG_RESET              (0x00000000)

/*=============================*/
struct __DMA3_B_STARTL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DMA3_B_STARTL                    : 16;
};
#define DMA3_B_STARTL                        (0xFFFF)



#define DMA3_B_STARTH_REG                    (0x50003636) /* Start address High B of DMA channel 3 */
#define DMA3_B_STARTH_REG_RESET              (0x00000000)

/*=============================*/
struct __DMA3_B_STARTH_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DMA3_B_STARTH                    : 16;
};
#define DMA3_B_STARTH                        (0xFFFF)



#define DMA3_INT_REG                         (0x50003638) /* DMA receive interrupt register channel 3 */
#define DMA3_INT_REG_RESET                   (0x00000000)

/*=============================*/
struct __DMA3_INT_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DMA3_INT                         : 16;
};
#define DMA3_INT                             (0xFFFF)



#define DMA3_LEN_REG                         (0x5000363A) /* DMA receive length register channel 3 */
#define DMA3_LEN_REG_RESET                   (0x00000000)

/*=============================*/
struct __DMA3_LEN_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DMA3_LEN                         : 16;
};
#define DMA3_LEN                             (0xFFFF)



#define DMA3_CTRL_REG                        (0x5000363C) /* Control register for the DMA channel 3 */
#define DMA3_CTRL_REG_RESET                  (0x00000000)

/*=============================*/
struct __DMA3_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DMA_ON                           : 1;
    volatile uint16_t BITFLD_BW                               : 2;
    volatile uint16_t BITFLD_IRQ_ENABLE                       : 1;
    volatile uint16_t BITFLD_DREQ_MODE                        : 1;
    volatile uint16_t BITFLD_BINC                             : 1;
    volatile uint16_t BITFLD_AINC                             : 1;
    volatile uint16_t BITFLD_CIRCULAR                         : 1;
    volatile uint16_t BITFLD_DMA_PRIO                         : 3;
    volatile uint16_t BITFLD_DMA_IDLE                         : 1;
    volatile uint16_t BITFLD_DMA_INIT                         : 1;
    volatile uint16_t BITFLD_REQ_SENSE                        : 1;
};
#define DMA_ON                               (0x0001)
#define BW                                   (0x0006)
#define IRQ_ENABLE                           (0x0008)
#define DREQ_MODE                            (0x0010)
#define BINC                                 (0x0020)
#define AINC                                 (0x0040)
#define CIRCULAR                             (0x0080)
#define DMA_PRIO                             (0x0700)
#define DMA_IDLE                             (0x0800)
#define DMA_INIT                             (0x1000)
#define REQ_SENSE                            (0x2000)



#define DMA3_IDX_REG                         (0x5000363E) /* Index value of DMA channel 3 */
#define DMA3_IDX_REG_RESET                   (0x00000000)

/*=============================*/
struct __DMA3_IDX_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DMA3_IDX                         : 16;
};
#define DMA3_IDX                             (0xFFFF)



#define DMA_REQ_MUX_REG                      (0x50003680) /* DMA channel assignments */
#define DMA_REQ_MUX_REG_RESET                (0x0000FFFF)

/*=============================*/
struct __DMA_REQ_MUX_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DMA01_SEL                        : 4;
    volatile uint16_t BITFLD_DMA23_SEL                        : 4;
    volatile uint16_t                                         : 4;
};
#define DMA01_SEL                            (0x000F)
#define DMA23_SEL                            (0x00F0)



#define DMA_INT_STATUS_REG                   (0x50003682) /* DMA interrupt status register */
#define DMA_INT_STATUS_REG_RESET             (0x00000000)

/*=============================*/
struct __DMA_INT_STATUS_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DMA_IRQ_CH0                      : 1;
    volatile uint16_t BITFLD_DMA_IRQ_CH1                      : 1;
    volatile uint16_t BITFLD_DMA_IRQ_CH2                      : 1;
    volatile uint16_t BITFLD_DMA_IRQ_CH3                      : 1;
    volatile uint16_t                                         : 1;
    volatile uint16_t                                         : 1;
    volatile uint16_t                                         : 1;
    volatile uint16_t                                         : 1;
};
#define DMA_IRQ_CH0                          (0x0001)
#define DMA_IRQ_CH1                          (0x0002)
#define DMA_IRQ_CH2                          (0x0004)
#define DMA_IRQ_CH3                          (0x0008)



#define DMA_CLEAR_INT_REG                    (0x50003684) /* DMA clear interrupt register */
#define DMA_CLEAR_INT_REG_RESET              (0x00000000)

/*=============================*/
struct __DMA_CLEAR_INT_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DMA_RST_IRQ_CH0                  : 1;
    volatile uint16_t BITFLD_DMA_RST_IRQ_CH1                  : 1;
    volatile uint16_t BITFLD_DMA_RST_IRQ_CH2                  : 1;
    volatile uint16_t BITFLD_DMA_RST_IRQ_CH3                  : 1;
    volatile uint16_t                                         : 1;
    volatile uint16_t                                         : 1;
    volatile uint16_t                                         : 1;
    volatile uint16_t                                         : 1;
};
#define DMA_RST_IRQ_CH0                      (0x0001)
#define DMA_RST_IRQ_CH1                      (0x0002)
#define DMA_RST_IRQ_CH2                      (0x0004)
#define DMA_RST_IRQ_CH3                      (0x0008)



/*===========================================================================*/
/* memory map GPADC */
/*===========================================================================*/



#define GP_ADC_CTRL_REG                      (0x50001500) /* General Purpose ADC Control Register */
#define GP_ADC_CTRL_REG_RESET                (0x00000000)

/*=============================*/
struct __GP_ADC_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_GP_ADC_EN                        : 1;
    volatile uint16_t BITFLD_GP_ADC_START                     : 1;
    volatile uint16_t                                         : 1;
    volatile uint16_t BITFLD_GP_ADC_CLK_SEL                   : 1;
    volatile uint16_t BITFLD_GP_ADC_INT                       : 1;
    volatile uint16_t BITFLD_GP_ADC_MINT                      : 1;
    volatile uint16_t BITFLD_GP_ADC_SEL                       : 4;
    volatile uint16_t BITFLD_GP_ADC_SIGN                      : 1;
    volatile uint16_t BITFLD_GP_ADC_SE                        : 1;
    volatile uint16_t BITFLD_GP_ADC_MUTE                      : 1;
    volatile uint16_t BITFLD_GP_ADC_CHOP                      : 1;
    volatile uint16_t BITFLD_GP_ADC_LDO_EN                    : 1;
    volatile uint16_t BITFLD_GP_ADC_LDO_ZERO                  : 1;
};
#define GP_ADC_EN                            (0x0001)
#define GP_ADC_START                         (0x0002)
#define GP_ADC_CLK_SEL                       (0x0008)
#define GP_ADC_INT                           (0x0010)
#define GP_ADC_MINT                          (0x0020)
#define GP_ADC_SEL                           (0x03C0)
#define GP_ADC_SIGN                          (0x0400)
#define GP_ADC_SE                            (0x0800)
#define GP_ADC_MUTE                          (0x1000)
#define GP_ADC_CHOP                          (0x2000)
#define GP_ADC_LDO_EN                        (0x4000)
#define GP_ADC_LDO_ZERO                      (0x8000)



