dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/sdk/platform/include/da14585_586.h
#define P05_MODE_REG                         (0x50003010) /* P05 Mode Register */
#define P05_MODE_REG_RESET                   (0x00000200)

/*=============================*/
struct __P05_MODE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_PID                              : 5;
    volatile uint16_t                                         : 3;
    volatile uint16_t BITFLD_PUPD                             : 2;
};
#define PID                                  (0x001F)
#define PUPD                                 (0x0300)



#define P06_MODE_REG                         (0x50003012) /* P06 Mode Register */
#define P06_MODE_REG_RESET                   (0x00000200)

/*=============================*/
struct __P06_MODE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_PID                              : 5;
    volatile uint16_t                                         : 3;
    volatile uint16_t BITFLD_PUPD                             : 2;
};
#define PID                                  (0x001F)
#define PUPD                                 (0x0300)



#define P07_MODE_REG                         (0x50003014) /* P07 Mode Register */
#define P07_MODE_REG_RESET                   (0x00000200)

/*=============================*/
struct __P07_MODE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_PID                              : 5;
    volatile uint16_t                                         : 3;
    volatile uint16_t BITFLD_PUPD                             : 2;
};
#define PID                                  (0x001F)
#define PUPD                                 (0x0300)



#define P1_DATA_REG                          (0x50003020) /* P1 Data input / output register */
#define P1_DATA_REG_RESET                    (0x00000020)

/*=============================*/
struct __P1_DATA_REG
/*=============================*/
{
    volatile uint16_t BITFLD_P1_DATA                          : 8;
};
#define P1_DATA                              (0x00FF)



#define P1_SET_DATA_REG                      (0x50003022) /* P1 Set port pins register */
#define P1_SET_DATA_REG_RESET                (0x00000000)

/*=============================*/
struct __P1_SET_DATA_REG
/*=============================*/
{
    volatile uint16_t BITFLD_P1_SET                           : 8;
};
#define P1_SET                               (0x00FF)



#define P1_RESET_DATA_REG                    (0x50003024) /* P1 Reset port pins register */
#define P1_RESET_DATA_REG_RESET              (0x00000000)

/*=============================*/
struct __P1_RESET_DATA_REG
/*=============================*/
{
    volatile uint16_t BITFLD_P1_RESET                         : 8;
};
#define P1_RESET                             (0x00FF)



#define P10_MODE_REG                         (0x50003026) /* P10 Mode Register */
#define P10_MODE_REG_RESET                   (0x00000200)

/*=============================*/
struct __P10_MODE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_PID                              : 5;
    volatile uint16_t                                         : 3;
    volatile uint16_t BITFLD_PUPD                             : 2;
};
#define PID                                  (0x001F)
#define PUPD                                 (0x0300)



#define P11_MODE_REG                         (0x50003028) /* P11 Mode Register */
#define P11_MODE_REG_RESET                   (0x00000200)

/*=============================*/
struct __P11_MODE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_PID                              : 5;
    volatile uint16_t                                         : 3;
    volatile uint16_t BITFLD_PUPD                             : 2;
};
#define PID                                  (0x001F)
#define PUPD                                 (0x0300)



#define P12_MODE_REG                         (0x5000302A) /* P12 Mode Register */
#define P12_MODE_REG_RESET                   (0x00000200)

/*=============================*/
struct __P12_MODE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_PID                              : 5;
    volatile uint16_t                                         : 3;
    volatile uint16_t BITFLD_PUPD                             : 2;
};
#define PID                                  (0x001F)
#define PUPD                                 (0x0300)



#define P13_MODE_REG                         (0x5000302C) /* P13 Mode Register */
#define P13_MODE_REG_RESET                   (0x00000200)

/*=============================*/
struct __P13_MODE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_PID                              : 5;
    volatile uint16_t                                         : 3;
    volatile uint16_t BITFLD_PUPD                             : 2;
};
#define PID                                  (0x001F)
#define PUPD                                 (0x0300)



#define P14_MODE_REG                         (0x5000302E) /* P14 Mode Register */
#define P14_MODE_REG_RESET                   (0x00000200)

/*=============================*/
struct __P14_MODE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_PID                              : 5;
    volatile uint16_t                                         : 3;
    volatile uint16_t BITFLD_PUPD                             : 2;
};
#define PID                                  (0x001F)
#define PUPD                                 (0x0300)



#define P15_MODE_REG                         (0x50003030) /* P15 Mode Register */
#define P15_MODE_REG_RESET                   (0x00000100)

/*=============================*/
struct __P15_MODE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_PID                              : 5;
    volatile uint16_t                                         : 3;
    volatile uint16_t BITFLD_PUPD                             : 2;
};
#define PID                                  (0x001F)
#define PUPD                                 (0x0300)



#define P2_DATA_REG                          (0x50003040) /* P2 Data input / output register */
#define P2_DATA_REG_RESET                    (0x00000000)

/*=============================*/
struct __P2_DATA_REG
/*=============================*/
{
    volatile uint16_t BITFLD_P2_DATA                          : 10;
};
