dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/sdk/platform/include/da14585_586.h
#define P2_DATA                              (0x03FF)



#define P2_SET_DATA_REG                      (0x50003042) /* P2 Set port pins register */
#define P2_SET_DATA_REG_RESET                (0x00000000)

/*=============================*/
struct __P2_SET_DATA_REG
/*=============================*/
{
    volatile uint16_t BITFLD_P2_SET                           : 10;
};
#define P2_SET                               (0x03FF)



#define P2_RESET_DATA_REG                    (0x50003044) /* P2 Reset port pins register */
#define P2_RESET_DATA_REG_RESET              (0x00000000)

/*=============================*/
struct __P2_RESET_DATA_REG
/*=============================*/
{
    volatile uint16_t BITFLD_P2_RESET                         : 10;
};
#define P2_RESET                             (0x03FF)



#define P20_MODE_REG                         (0x50003046) /* P20 Mode Register */
#define P20_MODE_REG_RESET                   (0x00000200)

/*=============================*/
struct __P20_MODE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_PID                              : 5;
    volatile uint16_t                                         : 3;
    volatile uint16_t BITFLD_PUPD                             : 2;
};
#define PID                                  (0x001F)
#define PUPD                                 (0x0300)



#define P21_MODE_REG                         (0x50003048) /* P21 Mode Register */
#define P21_MODE_REG_RESET                   (0x00000200)

/*=============================*/
struct __P21_MODE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_PID                              : 5;
    volatile uint16_t                                         : 3;
    volatile uint16_t BITFLD_PUPD                             : 2;
};
#define PID                                  (0x001F)
#define PUPD                                 (0x0300)



#define P22_MODE_REG                         (0x5000304A) /* P22 Mode Register */
#define P22_MODE_REG_RESET                   (0x00000200)

/*=============================*/
struct __P22_MODE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_PID                              : 5;
    volatile uint16_t                                         : 3;
    volatile uint16_t BITFLD_PUPD                             : 2;
};
#define PID                                  (0x001F)
#define PUPD                                 (0x0300)



#define P23_MODE_REG                         (0x5000304C) /* P23 Mode Register */
#define P23_MODE_REG_RESET                   (0x00000200)

/*=============================*/
struct __P23_MODE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_PID                              : 5;
    volatile uint16_t                                         : 3;
    volatile uint16_t BITFLD_PUPD                             : 2;
};
#define PID                                  (0x001F)
#define PUPD                                 (0x0300)



#define P24_MODE_REG                         (0x5000304E) /* P24 Mode Register */
#define P24_MODE_REG_RESET                   (0x00000200)

/*=============================*/
struct __P24_MODE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_PID                              : 5;
    volatile uint16_t                                         : 3;
    volatile uint16_t BITFLD_PUPD                             : 2;
};
#define PID                                  (0x001F)
#define PUPD                                 (0x0300)



#define P25_MODE_REG                         (0x50003050) /* P25 Mode Register */
#define P25_MODE_REG_RESET                   (0x00000200)

/*=============================*/
struct __P25_MODE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_PID                              : 5;
    volatile uint16_t                                         : 3;
    volatile uint16_t BITFLD_PUPD                             : 2;
};
#define PID                                  (0x001F)
#define PUPD                                 (0x0300)



#define P26_MODE_REG                         (0x50003052) /* P26 Mode Register */
#define P26_MODE_REG_RESET                   (0x00000200)

/*=============================*/
struct __P26_MODE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_PID                              : 5;
    volatile uint16_t                                         : 3;
    volatile uint16_t BITFLD_PUPD                             : 2;
};
#define PID                                  (0x001F)
#define PUPD                                 (0x0300)



#define P27_MODE_REG                         (0x50003054) /* P27 Mode Register */
#define P27_MODE_REG_RESET                   (0x00000200)

/*=============================*/
struct __P27_MODE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_PID                              : 5;
    volatile uint16_t                                         : 3;
    volatile uint16_t BITFLD_PUPD                             : 2;
};
#define PID                                  (0x001F)
#define PUPD                                 (0x0300)



#define P28_MODE_REG                         (0x50003056) /* P28 Mode Register */
#define P28_MODE_REG_RESET                   (0x00000200)

/*=============================*/
struct __P28_MODE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_PID                              : 5;
    volatile uint16_t                                         : 3;
    volatile uint16_t BITFLD_PUPD                             : 2;
};
#define PID                                  (0x001F)
#define PUPD                                 (0x0300)



#define P29_MODE_REG                         (0x50003058) /* P29 Mode Register */
#define P29_MODE_REG_RESET                   (0x00000200)

/*=============================*/
struct __P29_MODE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_PID                              : 5;
    volatile uint16_t                                         : 3;
    volatile uint16_t BITFLD_PUPD                             : 2;
};
#define PID                                  (0x001F)
#define PUPD                                 (0x0300)



