dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/sdk/platform/include/da14585_586.h
#define P01_PADPWR_CTRL_REG                  (0x50003070) /* Ports 0 and 1 Output Power Control Register */
#define P01_PADPWR_CTRL_REG_RESET            (0x00000000)

/*=============================*/
struct __P01_PADPWR_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_P0_OUT_CTRL                      : 8;
    volatile uint16_t BITFLD_P1_OUT_CTRL                      : 6;
};
#define P0_OUT_CTRL                          (0x00FF)
#define P1_OUT_CTRL                          (0x3F00)



#define P2_PADPWR_CTRL_REG                   (0x50003072) /* Port 2 Output Power Control Register */
#define P2_PADPWR_CTRL_REG_RESET             (0x00000000)

/*=============================*/
struct __P2_PADPWR_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_P2_OUT_CTRL                      : 10;
};
#define P2_OUT_CTRL                          (0x03FF)



#define P3_PADPWR_CTRL_REG                   (0x50003074) /* Port 3 Output Power Control Register */
#define P3_PADPWR_CTRL_REG_RESET             (0x00000000)

/*=============================*/
struct __P3_PADPWR_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_P3_OUT_CTRL                      : 8;
};
#define P3_OUT_CTRL                          (0x00FF)



#define P3_DATA_REG                          (0x50003080) /* P3 Data input / output register */
#define P3_DATA_REG_RESET                    (0x00000000)

/*=============================*/
struct __P3_DATA_REG
/*=============================*/
{
    volatile uint16_t BITFLD_P3_DATA                          : 8;
};
#define P3_DATA                              (0x00FF)



#define P3_SET_DATA_REG                      (0x50003082) /* P3 Set port pins register */
#define P3_SET_DATA_REG_RESET                (0x00000000)

/*=============================*/
struct __P3_SET_DATA_REG
/*=============================*/
{
    volatile uint16_t BITFLD_P3_SET                           : 8;
};
#define P3_SET                               (0x00FF)



#define P3_RESET_DATA_REG                    (0x50003084) /* P3 Reset port pins register */
#define P3_RESET_DATA_REG_RESET              (0x00000000)

/*=============================*/
struct __P3_RESET_DATA_REG
/*=============================*/
{
    volatile uint16_t BITFLD_P3_RESET                         : 8;
};
#define P3_RESET                             (0x00FF)



#define P30_MODE_REG                         (0x50003086) /* P30 Mode Register */
#define P30_MODE_REG_RESET                   (0x00000200)

/*=============================*/
struct __P30_MODE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_PID                              : 5;
    volatile uint16_t                                         : 3;
    volatile uint16_t BITFLD_PUPD                             : 2;
};
#define PID                                  (0x001F)
#define PUPD                                 (0x0300)



#define P31_MODE_REG                         (0x50003088) /* P31 Mode Register */
#define P31_MODE_REG_RESET                   (0x00000200)

/*=============================*/
struct __P31_MODE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_PID                              : 5;
    volatile uint16_t                                         : 3;
    volatile uint16_t BITFLD_PUPD                             : 2;
};
#define PID                                  (0x001F)
#define PUPD                                 (0x0300)



#define P32_MODE_REG                         (0x5000308A) /* P32 Mode Register */
#define P32_MODE_REG_RESET                   (0x00000200)

/*=============================*/
struct __P32_MODE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_PID                              : 5;
    volatile uint16_t                                         : 3;
    volatile uint16_t BITFLD_PUPD                             : 2;
};
#define PID                                  (0x001F)
#define PUPD                                 (0x0300)



#define P33_MODE_REG                         (0x5000308C) /* P33 Mode Register */
#define P33_MODE_REG_RESET                   (0x00000200)

/*=============================*/
struct __P33_MODE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_PID                              : 5;
    volatile uint16_t                                         : 3;
    volatile uint16_t BITFLD_PUPD                             : 2;
};
#define PID                                  (0x001F)
#define PUPD                                 (0x0300)



#define P34_MODE_REG                         (0x5000308E) /* P34 Mode Register */
#define P34_MODE_REG_RESET                   (0x00000200)

/*=============================*/
struct __P34_MODE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_PID                              : 5;
    volatile uint16_t                                         : 3;
    volatile uint16_t BITFLD_PUPD                             : 2;
};
#define PID                                  (0x001F)
#define PUPD                                 (0x0300)



#define P35_MODE_REG                         (0x50003090) /* P35 Mode Register */
#define P35_MODE_REG_RESET                   (0x00000200)

/*=============================*/
struct __P35_MODE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_PID                              : 5;
    volatile uint16_t                                         : 3;
    volatile uint16_t BITFLD_PUPD                             : 2;
};
#define PID                                  (0x001F)
#define PUPD                                 (0x0300)



#define P36_MODE_REG                         (0x50003092) /* P36 Mode Register */
#define P36_MODE_REG_RESET                   (0x00000200)

/*=============================*/
struct __P36_MODE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_PID                              : 5;
    volatile uint16_t                                         : 3;
    volatile uint16_t BITFLD_PUPD                             : 2;
};
#define PID                                  (0x001F)
#define PUPD                                 (0x0300)



#define P37_MODE_REG                         (0x50003094) /* P37 Mode Register */
#define P37_MODE_REG_RESET                   (0x00000200)

/*=============================*/
struct __P37_MODE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_PID                              : 5;
    volatile uint16_t                                         : 3;
    volatile uint16_t BITFLD_PUPD                             : 2;
};
#define PID                                  (0x001F)
#define PUPD                                 (0x0300)



/*===========================================================================*/
/* memory map GPREG */
/*===========================================================================*/



#define SET_FREEZE_REG                       (0x50003300) /* Controls freezing of various timers/counters. */
#define SET_FREEZE_REG_RESET                 (0x00000000)

/*=============================*/
struct __SET_FREEZE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_FRZ_WKUPTIM                      : 1;
    volatile uint16_t BITFLD_FRZ_SWTIM                        : 1;
    volatile uint16_t BITFLD_FRZ_BLETIM                       : 1;
    volatile uint16_t BITFLD_FRZ_WDOG                         : 1;
    volatile uint16_t BITFLD_FRZ_DMA                          : 1;
};
