dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/sdk/platform/include/da14585_586.h
#define IC_SS_SCL_HCNT                       (0xFFFF)



#define I2C_SS_SCL_LCNT_REG                  (0x50001318) /* Standard Speed I2C Clock SCL Low Count Register */
#define I2C_SS_SCL_LCNT_REG_RESET            (0x0000004F)

/*=============================*/
struct __I2C_SS_SCL_LCNT_REG
/*=============================*/
{
    volatile uint16_t BITFLD_IC_SS_SCL_LCNT                   : 16;
};
#define IC_SS_SCL_LCNT                       (0xFFFF)



#define I2C_FS_SCL_HCNT_REG                  (0x5000131C) /* Fast Speed I2C Clock SCL High Count Register */
#define I2C_FS_SCL_HCNT_REG_RESET            (0x00000008)

/*=============================*/
struct __I2C_FS_SCL_HCNT_REG
/*=============================*/
{
    volatile uint16_t BITFLD_IC_FS_SCL_HCNT                   : 16;
};
#define IC_FS_SCL_HCNT                       (0xFFFF)



#define I2C_FS_SCL_LCNT_REG                  (0x50001320) /* Fast Speed I2C Clock SCL Low Count Register */
#define I2C_FS_SCL_LCNT_REG_RESET            (0x00000017)

/*=============================*/
struct __I2C_FS_SCL_LCNT_REG
/*=============================*/
{
    volatile uint16_t BITFLD_IC_FS_SCL_LCNT                   : 16;
};
#define IC_FS_SCL_LCNT                       (0xFFFF)



#define I2C_INTR_STAT_REG                    (0x5000132C) /* I2C Interrupt Status Register */
#define I2C_INTR_STAT_REG_RESET              (0x00000000)

/*=============================*/
struct __I2C_INTR_STAT_REG
/*=============================*/
{
    volatile uint16_t BITFLD_R_RX_UNDER                       : 1;
    volatile uint16_t BITFLD_R_RX_OVER                        : 1;
    volatile uint16_t BITFLD_R_RX_FULL                        : 1;
    volatile uint16_t BITFLD_R_TX_OVER                        : 1;
    volatile uint16_t BITFLD_R_TX_EMPTY                       : 1;
    volatile uint16_t BITFLD_R_RD_REQ                         : 1;
    volatile uint16_t BITFLD_R_TX_ABRT                        : 1;
    volatile uint16_t BITFLD_R_RX_DONE                        : 1;
    volatile uint16_t BITFLD_R_ACTIVITY                       : 1;
    volatile uint16_t BITFLD_R_STOP_DET                       : 1;
    volatile uint16_t BITFLD_R_START_DET                      : 1;
    volatile uint16_t BITFLD_R_GEN_CALL                       : 1;
};
#define R_RX_UNDER                           (0x0001)
#define R_RX_OVER                            (0x0002)
#define R_RX_FULL                            (0x0004)
#define R_TX_OVER                            (0x0008)
#define R_TX_EMPTY                           (0x0010)
#define R_RD_REQ                             (0x0020)
#define R_TX_ABRT                            (0x0040)
#define R_RX_DONE                            (0x0080)
#define R_ACTIVITY                           (0x0100)
#define R_STOP_DET                           (0x0200)
#define R_START_DET                          (0x0400)
#define R_GEN_CALL                           (0x0800)



#define I2C_INTR_MASK_REG                    (0x50001330) /* I2C Interrupt Mask Register */
#define I2C_INTR_MASK_REG_RESET              (0x000008FF)

/*=============================*/
struct __I2C_INTR_MASK_REG
/*=============================*/
{
    volatile uint16_t BITFLD_M_RX_UNDER                       : 1;
    volatile uint16_t BITFLD_M_RX_OVER                        : 1;
    volatile uint16_t BITFLD_M_RX_FULL                        : 1;
    volatile uint16_t BITFLD_M_TX_OVER                        : 1;
    volatile uint16_t BITFLD_M_TX_EMPTY                       : 1;
    volatile uint16_t BITFLD_M_RD_REQ                         : 1;
    volatile uint16_t BITFLD_M_TX_ABRT                        : 1;
    volatile uint16_t BITFLD_M_RX_DONE                        : 1;
    volatile uint16_t BITFLD_M_ACTIVITY                       : 1;
    volatile uint16_t BITFLD_M_STOP_DET                       : 1;
    volatile uint16_t BITFLD_M_START_DET                      : 1;
    volatile uint16_t BITFLD_M_GEN_CALL                       : 1;
};
#define M_RX_UNDER                           (0x0001)
#define M_RX_OVER                            (0x0002)
#define M_RX_FULL                            (0x0004)
#define M_TX_OVER                            (0x0008)
#define M_TX_EMPTY                           (0x0010)
#define M_RD_REQ                             (0x0020)
#define M_TX_ABRT                            (0x0040)
#define M_RX_DONE                            (0x0080)
#define M_ACTIVITY                           (0x0100)
#define M_STOP_DET                           (0x0200)
#define M_START_DET                          (0x0400)
#define M_GEN_CALL                           (0x0800)



#define I2C_RAW_INTR_STAT_REG                (0x50001334) /* I2C Raw Interrupt Status Register */
#define I2C_RAW_INTR_STAT_REG_RESET          (0x00000000)

/*=============================*/
struct __I2C_RAW_INTR_STAT_REG
/*=============================*/
{
    volatile uint16_t BITFLD_RX_UNDER                         : 1;
    volatile uint16_t BITFLD_RX_OVER                          : 1;
    volatile uint16_t BITFLD_RX_FULL                          : 1;
    volatile uint16_t BITFLD_TX_OVER                          : 1;
    volatile uint16_t BITFLD_TX_EMPTY                         : 1;
    volatile uint16_t BITFLD_RD_REQ                           : 1;
    volatile uint16_t BITFLD_TX_ABRT                          : 1;
    volatile uint16_t BITFLD_RX_DONE                          : 1;
    volatile uint16_t BITFLD_ACTIVITY                         : 1;
    volatile uint16_t BITFLD_STOP_DET                         : 1;
    volatile uint16_t BITFLD_START_DET                        : 1;
    volatile uint16_t BITFLD_GEN_CALL                         : 1;
};
#define RX_UNDER                             (0x0001)
#define RX_OVER                              (0x0002)
#define RX_FULL                              (0x0004)
#define TX_OVER                              (0x0008)
#define TX_EMPTY                             (0x0010)
#define RD_REQ                               (0x0020)
#define TX_ABRT                              (0x0040)
#define RX_DONE                              (0x0080)
#define ACTIVITY                             (0x0100)
#define STOP_DET                             (0x0200)
#define START_DET                            (0x0400)
#define GEN_CALL                             (0x0800)



