dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/sdk/platform/include/da14585_586.h
#define GPIO_INT_LEVEL_CTRL_REG              (0x50001410) /* high or low level select for GPIO interrupts */
#define GPIO_INT_LEVEL_CTRL_REG_RESET        (0x00000000)

/*=============================*/
struct __GPIO_INT_LEVEL_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_INPUT_LEVEL0                     : 1;
    volatile uint16_t BITFLD_INPUT_LEVEL1                     : 1;
    volatile uint16_t BITFLD_INPUT_LEVEL2                     : 1;
    volatile uint16_t BITFLD_INPUT_LEVEL3                     : 1;
    volatile uint16_t BITFLD_INPUT_LEVEL4                     : 1;
    volatile uint16_t                                         : 1;
    volatile uint16_t                                         : 2;
    volatile uint16_t BITFLD_EDGE_LEVELn0                     : 1;
    volatile uint16_t BITFLD_EDGE_LEVELn1                     : 1;
    volatile uint16_t BITFLD_EDGE_LEVELn2                     : 1;
    volatile uint16_t BITFLD_EDGE_LEVELn3                     : 1;
    volatile uint16_t BITFLD_EDGE_LEVELn4                     : 1;
    volatile uint16_t                                         : 1;
};
#define INPUT_LEVEL0                         (0x0001)
#define INPUT_LEVEL1                         (0x0002)
#define INPUT_LEVEL2                         (0x0004)
#define INPUT_LEVEL3                         (0x0008)
#define INPUT_LEVEL4                         (0x0010)
#define EDGE_LEVELn0                         (0x0100)
#define EDGE_LEVELn1                         (0x0200)
#define EDGE_LEVELn2                         (0x0400)
#define EDGE_LEVELn3                         (0x0800)
#define EDGE_LEVELn4                         (0x1000)



#define KBRD_IRQ_IN_SEL0_REG                 (0x50001412) /* GPIO interrupt selection for KBRD_IRQ for P0 */
#define KBRD_IRQ_IN_SEL0_REG_RESET           (0x00000000)

/*=============================*/
struct __KBRD_IRQ_IN_SEL0_REG
/*=============================*/
{
    volatile uint16_t BITFLD_KBRD_P00_EN                      : 1;
    volatile uint16_t BITFLD_KBRD_P01_EN                      : 1;
    volatile uint16_t BITFLD_KBRD_P02_EN                      : 1;
    volatile uint16_t BITFLD_KBRD_P03_EN                      : 1;
    volatile uint16_t BITFLD_KBRD_P04_EN                      : 1;
    volatile uint16_t BITFLD_KBRD_P05_EN                      : 1;
    volatile uint16_t BITFLD_KBRD_P06_EN                      : 1;
    volatile uint16_t BITFLD_KBRD_P07_EN                      : 1;
    volatile uint16_t BITFLD_KEY_REPEAT                       : 6;
    volatile uint16_t BITFLD_KBRD_LEVEL                       : 1;
    volatile uint16_t BITFLD_KBRD_REL                         : 1;
};
#define KBRD_P00_EN                          (0x0001)
#define KBRD_P01_EN                          (0x0002)
#define KBRD_P02_EN                          (0x0004)
#define KBRD_P03_EN                          (0x0008)
#define KBRD_P04_EN                          (0x0010)
#define KBRD_P05_EN                          (0x0020)
#define KBRD_P06_EN                          (0x0040)
#define KBRD_P07_EN                          (0x0080)
#define KEY_REPEAT                           (0x3F00)
#define KBRD_LEVEL                           (0x4000)
#define KBRD_REL                             (0x8000)



#define KBRD_IRQ_IN_SEL1_REG                 (0x50001414) /* GPIO interrupt selection for KBRD_IRQ for P1 and P2 */
#define KBRD_IRQ_IN_SEL1_REG_RESET           (0x00000000)

/*=============================*/
struct __KBRD_IRQ_IN_SEL1_REG
/*=============================*/
{
    volatile uint16_t BITFLD_KBRD_P20_EN                      : 1;
    volatile uint16_t BITFLD_KBRD_P21_EN                      : 1;
    volatile uint16_t BITFLD_KBRD_P22_EN                      : 1;
    volatile uint16_t BITFLD_KBRD_P23_EN                      : 1;
    volatile uint16_t BITFLD_KBRD_P24_EN                      : 1;
    volatile uint16_t BITFLD_KBRD_P25_EN                      : 1;
    volatile uint16_t BITFLD_KBRD_P26_EN                      : 1;
    volatile uint16_t BITFLD_KBRD_P27_EN                      : 1;
    volatile uint16_t BITFLD_KBRD_P28_EN                      : 1;
    volatile uint16_t BITFLD_KBRD_P29_EN                      : 1;
    volatile uint16_t BITFLD_KBRD_P10_EN                      : 1;
    volatile uint16_t BITFLD_KBRD_P11_EN                      : 1;
    volatile uint16_t BITFLD_KBRD_P12_EN                      : 1;
    volatile uint16_t BITFLD_KBRD_P13_EN                      : 1;
    volatile uint16_t BITFLD_KBRD_P14_EN                      : 1;
    volatile uint16_t BITFLD_KBRD_P15_EN                      : 1;
};
#define KBRD_P20_EN                          (0x0001)
#define KBRD_P21_EN                          (0x0002)
#define KBRD_P22_EN                          (0x0004)
#define KBRD_P23_EN                          (0x0008)
#define KBRD_P24_EN                          (0x0010)
#define KBRD_P25_EN                          (0x0020)
#define KBRD_P26_EN                          (0x0040)
#define KBRD_P27_EN                          (0x0080)
#define KBRD_P28_EN                          (0x0100)
#define KBRD_P29_EN                          (0x0200)
#define KBRD_P10_EN                          (0x0400)
#define KBRD_P11_EN                          (0x0800)
#define KBRD_P12_EN                          (0x1000)
#define KBRD_P13_EN                          (0x2000)
#define KBRD_P14_EN                          (0x4000)
#define KBRD_P15_EN                          (0x8000)



#define KBRD_IRQ_IN_SEL2_REG                 (0x50001416) /* GPIO interrupt selection for KBRD_IRQ for P3 */
#define KBRD_IRQ_IN_SEL2_REG_RESET           (0x00000000)

/*=============================*/
struct __KBRD_IRQ_IN_SEL2_REG
/*=============================*/
{
    volatile uint16_t BITFLD_KBRD_P30_EN                      : 1;
    volatile uint16_t BITFLD_KBRD_P31_EN                      : 1;
    volatile uint16_t BITFLD_KBRD_P32_EN                      : 1;
    volatile uint16_t BITFLD_KBRD_P33_EN                      : 1;
    volatile uint16_t BITFLD_KBRD_P34_EN                      : 1;
    volatile uint16_t BITFLD_KBRD_P35_EN                      : 1;
    volatile uint16_t BITFLD_KBRD_P36_EN                      : 1;
    volatile uint16_t BITFLD_KBRD_P37_EN                      : 1;
};
#define KBRD_P30_EN                          (0x0001)
#define KBRD_P31_EN                          (0x0002)
#define KBRD_P32_EN                          (0x0004)
#define KBRD_P33_EN                          (0x0008)
#define KBRD_P34_EN                          (0x0010)
#define KBRD_P35_EN                          (0x0020)
#define KBRD_P36_EN                          (0x0040)
#define KBRD_P37_EN                          (0x0080)



/*===========================================================================*/
/* memory map OTPC */
/*===========================================================================*/



#define OTPC_MODE_REG                        (0x07F40000) /* Mode register */
#define OTPC_MODE_REG_RESET                  (0x00000000)

/*=============================*/
struct __OTPC_MODE_REG
/*=============================*/
{
    volatile uint32_t BITFLD_OTPC_MODE_MODE                   : 3;
    volatile uint32_t                                         : 1;
    volatile uint32_t BITFLD_OTPC_MODE_USE_DMA                : 1;
    volatile uint32_t BITFLD_OTPC_MODE_FIFO_FLUSH             : 1;
    volatile uint32_t BITFLD_OTPC_MODE_ERR_RESP_DIS           : 1;
    volatile uint32_t                                         : 1;
    volatile uint32_t BITFLD_OTPC_MODE_USE_SP_ROWS            : 1;
    volatile uint32_t BITFLD_OTPC_MODE_RLD_RR_REQ             : 1;
    volatile uint32_t BITFLD_OTPC_MODE_BCHK_ALG               : 2;
    volatile uint32_t BITFLD_OTPC_MODE_BCHK_THR               : 3;
};
#define OTPC_MODE_MODE                       (0x0007)
#define OTPC_MODE_USE_DMA                    (0x0010)
#define OTPC_MODE_FIFO_FLUSH                 (0x0020)
#define OTPC_MODE_ERR_RESP_DIS               (0x0040)
#define OTPC_MODE_USE_SP_ROWS                (0x0100)
#define OTPC_MODE_RLD_RR_REQ                 (0x0200)
#define OTPC_MODE_BCHK_ALG                   (0x0C00)
#define OTPC_MODE_BCHK_THR                   (0x7000)



