dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/sdk/platform/include/da14585_586.h
#define OTPC_PCTRL_REG                       (0x07F40004) /* Bit-programming control register */
#define OTPC_PCTRL_REG_RESET                 (0x00000000)

/*=============================*/
struct __OTPC_PCTRL_REG
/*=============================*/
{
    volatile uint32_t BITFLD_OTPC_PCTRL_WADDR                 : 13;
    volatile uint32_t                                         : 1;
    volatile uint32_t BITFLD_OTPC_PCTRL_PRETRY                : 1;
    volatile uint32_t BITFLD_OTPC_PCTRL_PSTART                : 1;
};
#define OTPC_PCTRL_WADDR                     (0x1FFF)
#define OTPC_PCTRL_PRETRY                    (0x4000)
#define OTPC_PCTRL_PSTART                    (0x8000)



#define OTPC_STAT_REG                        (0x07F40008) /* Status register */
#define OTPC_STAT_REG_RESET                  (0x00000051)

/*=============================*/
struct __OTPC_STAT_REG
/*=============================*/
{
    volatile uint32_t BITFLD_OTPC_STAT_PRDY                   : 1;
    volatile uint32_t BITFLD_OTPC_STAT_PERR_UNC               : 1;
    volatile uint32_t BITFLD_OTPC_STAT_PERR_COR               : 1;
    volatile uint32_t BITFLD_OTPC_STAT_PZERO                  : 1;
    volatile uint32_t BITFLD_OTPC_STAT_TRDY                   : 1;
    volatile uint32_t BITFLD_OTPC_STAT_TERROR                 : 1;
    volatile uint32_t BITFLD_OTPC_STAT_ARDY                   : 1;
    volatile uint32_t BITFLD_OTPC_STAT_RERROR                 : 1;
    volatile uint32_t BITFLD_OTPC_STAT_FWORDS                 : 4;
    volatile uint32_t                                         : 4;
    volatile uint32_t BITFLD_OTPC_STAT_NWORDS                 : 14;
};
#define OTPC_STAT_PRDY                       (0x0001)
#define OTPC_STAT_PERR_UNC                   (0x0002)
#define OTPC_STAT_PERR_COR                   (0x0004)
#define OTPC_STAT_PZERO                      (0x0008)
#define OTPC_STAT_TRDY                       (0x0010)
#define OTPC_STAT_TERROR                     (0x0020)
#define OTPC_STAT_ARDY                       (0x0040)
#define OTPC_STAT_RERROR                     (0x0080)
#define OTPC_STAT_FWORDS                     (0x0F00)
#define OTPC_STAT_NWORDS                     (0x3FFF0000)



#define OTPC_AHBADR_REG                      (0x07F4000C) /* AHB master start address */
#define OTPC_AHBADR_REG_RESET                (0x07FC0000)

/*=============================*/
struct __OTPC_AHBADR_REG
/*=============================*/
{
    volatile uint32_t                                         : 2;
    volatile uint32_t BITFLD_OTPC_AHBADR                      : 30;
};
#define OTPC_AHBADR                          (0xFFFFFFFC)



#define OTPC_CELADR_REG                      (0x07F40010) /* Macrocell start address */
#define OTPC_CELADR_REG_RESET                (0x00000000)

/*=============================*/
struct __OTPC_CELADR_REG
/*=============================*/
{
    volatile uint32_t BITFLD_OTPC_CELADR                      : 14;
    volatile uint32_t                                         : 2;
    volatile uint32_t BITFLD_OTPC_CELADR_LV                   : 14;
};
#define OTPC_CELADR                          (0x3FFF)
#define OTPC_CELADR_LV                       (0x3FFF0000)



#define OTPC_NWORDS_REG                      (0x07F40014) /* Number of words */
#define OTPC_NWORDS_REG_RESET                (0x00000000)

/*=============================*/
struct __OTPC_NWORDS_REG
/*=============================*/
{
    volatile uint32_t BITFLD_OTPC_NWORDS                      : 14;
};
#define OTPC_NWORDS                          (0x3FFF)



#define OTPC_FFPRT_REG                       (0x07F40018) /* Ports access to fifo logic */
#define OTPC_FFPRT_REG_RESET                 (0x00000000)

/*=============================*/
struct __OTPC_FFPRT_REG
/*=============================*/
{
    volatile uint32_t BITFLD_OTPC_FFPRT                       : 32;
};
#define OTPC_FFPRT                           (0xFFFFFFFF)



#define OTPC_FFRD_REG                        (0x07F4001C) /* The data which have taken with the latest read from the OTPC_FFPRT_REG */
#define OTPC_FFRD_REG_RESET                  (0x00000000)

/*=============================*/
struct __OTPC_FFRD_REG
/*=============================*/
{
    volatile uint32_t BITFLD_OTPC_FFRD                        : 32;
};
#define OTPC_FFRD                            (0xFFFFFFFF)



#define OTPC_PWORDL_REG                      (0x07F40020) /* The 32 lower bits of the 64-bit word that will be programmed, when the MPROG mode is used. */
#define OTPC_PWORDL_REG_RESET                (0x00000000)

/*=============================*/
struct __OTPC_PWORDL_REG
/*=============================*/
{
    volatile uint32_t BITFLD_OTPC_PWORDL                      : 32;
};
#define OTPC_PWORDL                          (0xFFFFFFFF)



#define OTPC_PWORDH_REG                      (0x07F40024) /* The 32 higher bits of the 64-bit word that will be programmed, when the MPROG mode is used. */
#define OTPC_PWORDH_REG_RESET                (0x00000000)

/*=============================*/
struct __OTPC_PWORDH_REG
/*=============================*/
{
    volatile uint32_t BITFLD_OTPC_PWORDH                      : 32;
};
#define OTPC_PWORDH                          (0xFFFFFFFF)



#define OTPC_TIM1_REG                        (0x07F40028) /* Various timing parameters of the OTP cell. */
#define OTPC_TIM1_REG_RESET                  (0x1A104F20)

/*=============================*/
struct __OTPC_TIM1_REG
/*=============================*/
{
    volatile uint32_t BITFLD_OTPC_TIM1_CC_T_CADX              : 8;
    volatile uint32_t BITFLD_OTPC_TIM1_CC_T_PW                : 8;
    volatile uint32_t BITFLD_OTPC_TIM1_CC_T_1US               : 6;
    volatile uint32_t BITFLD_OTPC_TIM1_CC_T_500NS             : 5;
    volatile uint32_t BITFLD_OTPC_TIM1_CC_T_200NS             : 4;
    volatile uint32_t BITFLD_OTPC_TIM1_CC_T_25NS              : 1;
};
#define OTPC_TIM1_CC_T_CADX                  (0x00FF)
#define OTPC_TIM1_CC_T_PW                    (0xFF00)
#define OTPC_TIM1_CC_T_1US                   (0x3F0000)
#define OTPC_TIM1_CC_T_500NS                 (0x7C00000)
#define OTPC_TIM1_CC_T_200NS                 (0x78000000)
#define OTPC_TIM1_CC_T_25NS                  (0x80000000)



