dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/sdk/platform/include/da14585_586.h
#define OTPC_TIM2_REG                        (0x07F4002C) /* Various timing parameters of the OTP cell. */
#define OTPC_TIM2_REG_RESET                  (0x00010000)

/*=============================*/
struct __OTPC_TIM2_REG
/*=============================*/
{
    volatile uint32_t BITFLD_OTPC_TIM2_CC_STBY_THR            : 10;
    volatile uint32_t                                         : 6;
    volatile uint32_t BITFLD_OTPC_TIM2_CC_T_BCHK              : 7;
    volatile uint32_t BITFLD_OTPC_TIM2_RDENL_PROT             : 1;
};
#define OTPC_TIM2_CC_STBY_THR                (0x03FF)
#define OTPC_TIM2_CC_T_BCHK                  (0x7F0000)
#define OTPC_TIM2_RDENL_PROT                 (0x800000)



#define OTPC_BCSTS_REG                       (0x07F40034) /* Blank check status register */
#define OTPC_BCSTS_REG_RESET                 (0x00000000)

/*=============================*/
struct __OTPC_BCSTS_REG
/*=============================*/
{
    volatile uint32_t BITFLD_OTPC_BCHK_EQ1_WCNT               : 14;
    volatile uint32_t                                         : 2;
    volatile uint32_t BITFLD_OTPC_BCHK_BEQ2_WCNT              : 14;
};
#define OTPC_BCHK_EQ1_WCNT                   (0x3FFF)
#define OTPC_BCHK_BEQ2_WCNT                  (0x3FFF0000)



/*===========================================================================*/
/* memory map PATCH */
/*===========================================================================*/
//reserved only



/*===========================================================================*/
/* memory map QDEC */
/*===========================================================================*/



#define QDEC_CTRL_REG                        (0x50000200) /* Quad Decoder control register */
#define QDEC_CTRL_REG_RESET                  (0x00000010)

/*=============================*/
struct __QDEC_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_QD_IRQ_MASK                      : 1;
    volatile uint16_t BITFLD_QD_IRQ_CLR                       : 1;
    volatile uint16_t BITFLD_QD_IRQ_STATUS                    : 1;
    volatile uint16_t BITFLD_QD_IRQ_THRES                     : 7;
};
#define QD_IRQ_MASK                          (0x0001)
#define QD_IRQ_CLR                           (0x0002)
#define QD_IRQ_STATUS                        (0x0004)
#define QD_IRQ_THRES                         (0x03F8)



#define QDEC_XCNT_REG                        (0x50000202) /* Counter value of the X Axis */
#define QDEC_XCNT_REG_RESET                  (0x00000000)

/*=============================*/
struct __QDEC_XCNT_REG
/*=============================*/
{
    volatile uint16_t BITFLD_X_counter                        : 16;
};
#define X_counter                            (0xFFFF)



#define QDEC_YCNT_REG                        (0x50000204) /* Counter value of the Y Axis */
#define QDEC_YCNT_REG_RESET                  (0x00000000)

/*=============================*/
struct __QDEC_YCNT_REG
/*=============================*/
{
    volatile uint16_t BITFLD_Y_counter                        : 16;
};
#define Y_counter                            (0xFFFF)



#define QDEC_CLOCKDIV_REG                    (0x50000206) /* Clock divider register */
#define QDEC_CLOCKDIV_REG_RESET              (0x00000000)

/*=============================*/
struct __QDEC_CLOCKDIV_REG
/*=============================*/
{
    volatile uint16_t BITFLD_clock_divider                    : 10;
};
#define clock_divider                        (0x03FF)



#define QDEC_CTRL2_REG                       (0x50000208) /* Quad Decoder control register */
#define QDEC_CTRL2_REG_RESET                 (0x00000000)

/*=============================*/
struct __QDEC_CTRL2_REG
/*=============================*/
{
    volatile uint16_t BITFLD_CHX_PORT_SEL                     : 4;
    volatile uint16_t BITFLD_CHY_PORT_SEL                     : 4;
    volatile uint16_t BITFLD_CHZ_PORT_SEL                     : 4;
};
#define CHX_PORT_SEL                         (0x000F)
#define CHY_PORT_SEL                         (0x00F0)
#define CHZ_PORT_SEL                         (0x0F00)



#define QDEC_ZCNT_REG                        (0x5000020A) /* Z_counter */
#define QDEC_ZCNT_REG_RESET                  (0x00000000)

/*=============================*/
struct __QDEC_ZCNT_REG
/*=============================*/
{
    volatile uint16_t BITFLD_Z_counter                        : 16;
};
#define Z_counter                            (0xFFFF)



/*===========================================================================*/
/* memory map r_rfcu585_nl00 */
/*===========================================================================*/
//reserved only



/*===========================================================================*/
/* memory map rfpt580_gr01 */
/*===========================================================================*/
//reserved only



/*===========================================================================*/
/* memory map SPI */
/*===========================================================================*/



#define SPI_CTRL_REG                         (0x50001200) /* SPI control register 0 */
#define SPI_CTRL_REG_RESET                   (0x00000000)

/*=============================*/
struct __SPI_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_SPI_ON                           : 1;
    volatile uint16_t BITFLD_SPI_PHA                          : 1;
    volatile uint16_t BITFLD_SPI_POL                          : 1;
    volatile uint16_t BITFLD_SPI_CLK                          : 2;
    volatile uint16_t BITFLD_SPI_DO                           : 1;
    volatile uint16_t BITFLD_SPI_SMN                          : 1;
    volatile uint16_t BITFLD_SPI_WORD                         : 2;
    volatile uint16_t BITFLD_SPI_RST                          : 1;
    volatile uint16_t BITFLD_SPI_FORCE_DO                     : 1;
    volatile uint16_t BITFLD_SPI_TXH                          : 1;
    volatile uint16_t BITFLD_SPI_DI                           : 1;
    volatile uint16_t BITFLD_SPI_INT_BIT                      : 1;
    volatile uint16_t BITFLD_SPI_MINT                         : 1;
    volatile uint16_t BITFLD_SPI_EN_CTRL                      : 1;
};
