dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/sdk/platform/include/da14585_586.h
#define SPI_ON                               (0x0001)
#define SPI_PHA                              (0x0002)
#define SPI_POL                              (0x0004)
#define SPI_CLK                              (0x0018)
#define SPI_DO                               (0x0020)
#define SPI_SMN                              (0x0040)
#define SPI_WORD                             (0x0180)
#define SPI_RST                              (0x0200)
#define SPI_FORCE_DO                         (0x0400)
#define SPI_TXH                              (0x0800)
#define SPI_DI                               (0x1000)
#define SPI_INT_BIT                          (0x2000)
#define SPI_MINT                             (0x4000)
#define SPI_EN_CTRL                          (0x8000)



#define SPI_RX_TX_REG0                       (0x50001202) /* SPI RX/TX register0 */
#define SPI_RX_TX_REG0_RESET                 (0x00000000)

/*=============================*/
struct __SPI_RX_TX_REG0
/*=============================*/
{
    volatile uint16_t BITFLD_SPI_DATA0                        : 16;
};
#define SPI_DATA0                            (0xFFFF)



#define SPI_RX_TX_REG1                       (0x50001204) /* SPI RX/TX register1 */
#define SPI_RX_TX_REG1_RESET                 (0x00000000)

/*=============================*/
struct __SPI_RX_TX_REG1
/*=============================*/
{
    volatile uint16_t BITFLD_SPI_DATA1                        : 16;
};
#define SPI_DATA1                            (0xFFFF)



#define SPI_CLEAR_INT_REG                    (0x50001206) /* SPI clear interrupt register */
#define SPI_CLEAR_INT_REG_RESET              (0x00000000)

/*=============================*/
struct __SPI_CLEAR_INT_REG
/*=============================*/
{
    volatile uint16_t BITFLD_SPI_CLEAR_INT                    : 16;
};
#define SPI_CLEAR_INT                        (0xFFFF)



#define SPI_CTRL_REG1                        (0x50001208) /* SPI control register 1 */
#define SPI_CTRL_REG1_RESET                  (0x00000003)

/*=============================*/
struct __SPI_CTRL_REG1
/*=============================*/
{
    volatile uint16_t BITFLD_SPI_FIFO_MODE                    : 2;
    volatile uint16_t BITFLD_SPI_PRIORITY                     : 1;
    volatile uint16_t BITFLD_SPI_BUSY                         : 1;
    volatile uint16_t BITFLD_SPI_9BIT_VAL                     : 1;
};
#define SPI_FIFO_MODE                        (0x0003)
#define SPI_PRIORITY                         (0x0004)
#define SPI_BUSY                             (0x0008)
#define SPI_9BIT_VAL                         (0x0010)



/*===========================================================================*/
/* memory map Timer+3PWM */
/*===========================================================================*/



#define TIMER0_CTRL_REG                      (0x50003400) /* Timer0 control register */
#define TIMER0_CTRL_REG_RESET                (0x00000000)

/*=============================*/
struct __TIMER0_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_TIM0_CTRL                        : 1;
    volatile uint16_t BITFLD_TIM0_CLK_SEL                     : 1;
    volatile uint16_t BITFLD_TIM0_CLK_DIV                     : 1;
    volatile uint16_t BITFLD_PWM_MODE                         : 1;
};
#define TIM0_CTRL                            (0x0001)
#define TIM0_CLK_SEL                         (0x0002)
#define TIM0_CLK_DIV                         (0x0004)
#define PWM_MODE                             (0x0008)



#define TIMER0_ON_REG                        (0x50003402) /* Timer0 on control register */
#define TIMER0_ON_REG_RESET                  (0x00000000)

/*=============================*/
struct __TIMER0_ON_REG
/*=============================*/
{
    volatile uint16_t BITFLD_TIM0_ON                          : 16;
};
#define TIM0_ON                              (0xFFFF)



#define TIMER0_RELOAD_M_REG                  (0x50003404) /* 16 bits reload value for Timer0 */
#define TIMER0_RELOAD_M_REG_RESET            (0x00000000)

/*=============================*/
struct __TIMER0_RELOAD_M_REG
/*=============================*/
{
    volatile uint16_t BITFLD_TIM0_M                           : 16;
};
#define TIM0_M                               (0xFFFF)



#define TIMER0_RELOAD_N_REG                  (0x50003406) /* 16 bits reload value for Timer0 */
#define TIMER0_RELOAD_N_REG_RESET            (0x00000000)

/*=============================*/
struct __TIMER0_RELOAD_N_REG
/*=============================*/
{
    volatile uint16_t BITFLD_TIM0_N                           : 16;
};
#define TIM0_N                               (0xFFFF)



#define PWM2_DUTY_CYCLE                      (0x50003408) /* Duty Cycle for PWM2 */
#define PWM2_DUTY_CYCLE_RESET                (0x00000000)

/*=============================*/
struct __PWM2_DUTY_CYCLE
/*=============================*/
{
    volatile uint16_t BITFLD_DUTY_CYCLE                       : 14;
};
#define DUTY_CYCLE                           (0x3FFF)



#define PWM3_DUTY_CYCLE                      (0x5000340A) /* Duty Cycle for PWM3 */
#define PWM3_DUTY_CYCLE_RESET                (0x00000000)

/*=============================*/
struct __PWM3_DUTY_CYCLE
/*=============================*/
{
    volatile uint16_t BITFLD_DUTY_CYCLE                       : 14;
};
#define DUTY_CYCLE                           (0x3FFF)



#define PWM4_DUTY_CYCLE                      (0x5000340C) /* Duty Cycle for PWM4 */
#define PWM4_DUTY_CYCLE_RESET                (0x00000000)

/*=============================*/
struct __PWM4_DUTY_CYCLE
/*=============================*/
{
    volatile uint16_t BITFLD_DUTY_CYCLE                       : 14;
};
#define DUTY_CYCLE                           (0x3FFF)



#define TRIPLE_PWM_FREQUENCY                 (0x5000340E) /* Frequency for PWM 2,3 and 4 */
#define TRIPLE_PWM_FREQUENCY_RESET           (0x00000000)

/*=============================*/
struct __TRIPLE_PWM_FREQUENCY
/*=============================*/
{
    volatile uint16_t BITFLD_FREQ                             : 14;
};
