dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/sdk/platform/include/da14585_586.h
#define UART_SHADOW_RCVR_TRIGGER             (0x0003)



#define UART2_STET_REG                       (0x500011A0) /* Shadow TX Empty Trigger */
#define UART2_STET_REG_RESET                 (0x00000000)

/*=============================*/
struct __UART2_STET_REG
/*=============================*/
{
    volatile uint16_t BITFLD_UART_SHADOW_TX_EMPTY_TRIGGER     : 2;
};
#define UART_SHADOW_TX_EMPTY_TRIGGER         (0x0003)



#define UART2_HTX_REG                        (0x500011A4) /* Halt TX */
#define UART2_HTX_REG_RESET                  (0x00000000)

/*=============================*/
struct __UART2_HTX_REG
/*=============================*/
{
    volatile uint16_t BITFLD_UART_HALT_TX                     : 1;
};
#define UART_HALT_TX                         (0x0001)



#define UART2_DMASA_REG                      (0x500011A8) /* DMA Software Acknowledge */
#define UART2_DMASA_REG_RESET                (0x00000000)

/*=============================*/
struct __UART2_DMASA_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DMASA                            : 1;
};
#define DMASA                                (0x0001)



#define UART2_DLF_REG                        (0x500011C0) /* Divisor Latch Fraction Register */
#define UART2_DLF_REG_RESET                  (0x00000000)

/*=============================*/
struct __UART2_DLF_REG
/*=============================*/
{
    volatile uint16_t BITFLD_UART_DLF                         : 4;
};
#define UART_DLF                             (0x000F)



#define UART2_CPR_REG                        (0x500011F4) /* Component Parameter Register */
#define UART2_CPR_REG_RESET                  (0x00003D71)

/*=============================*/
struct __UART2_CPR_REG
/*=============================*/
{
    volatile uint16_t BITFLD_CPR                              : 16;
};
#define CPR                                  (0xFFFF)



#define UART2_UCV_REG                        (0x500011F8) /* Component Version */
#define UART2_UCV_REG_RESET                  (0x3331352A)

/*=============================*/
struct __UART2_UCV_REG
/*=============================*/
{
    volatile uint16_t BITFLD_UCV                              : 16;
};
#define UCV                                  (0xFFFF)



#define UART2_CTR_REG                        (0x500011FC) /* Component Type Register */
#define UART2_CTR_REG_RESET                  (0x44570110)

/*=============================*/
struct __UART2_CTR_REG
/*=============================*/
{
    volatile uint16_t BITFLD_CTR                              : 16;
};
#define CTR                                  (0xFFFF)



/*===========================================================================*/
/* memory map Version */
/*===========================================================================*/



#define CHIP_ID1_REG                         (0x50003200) /* Chip identification register 1. */
#define CHIP_ID1_REG_RESET                   (0x00000035)

/*=============================*/
struct __CHIP_ID1_REG
/*=============================*/
{
    volatile uint8_t  BITFLD_CHIP_ID1                         : 8;
};
#define CHIP_ID1                             (0x00FF)



#define CHIP_ID2_REG                         (0x50003201) /* Chip identification register 2. */
#define CHIP_ID2_REG_RESET                   (0x00000038)

/*=============================*/
struct __CHIP_ID2_REG
/*=============================*/
{
    volatile uint8_t  BITFLD_CHIP_ID2                         : 8;
};
#define CHIP_ID2                             (0x00FF)



#define CHIP_ID3_REG                         (0x50003202) /* Chip identification register 3. */
#define CHIP_ID3_REG_RESET                   (0x00000035)

/*=============================*/
struct __CHIP_ID3_REG
/*=============================*/
{
    volatile uint8_t  BITFLD_CHIP_ID3                         : 8;
};
#define CHIP_ID3                             (0x00FF)



#define CHIP_SWC_REG                         (0x50003203) /* Software compatibility register. */
#define CHIP_SWC_REG_RESET                   (0x00000000)

/*=============================*/
struct __CHIP_SWC_REG
/*=============================*/
{
    volatile uint8_t  BITFLD_CHIP_SWC                         : 4;
};
#define CHIP_SWC                             (0x000F)



#define CHIP_REVISION_REG                    (0x50003204) /* Chip revision register. */
#define CHIP_REVISION_REG_RESET              (0x00000041)

/*=============================*/
struct __CHIP_REVISION_REG
/*=============================*/
{
    volatile uint8_t  BITFLD_REVISION_ID                      : 8;
};
#define REVISION_ID                          (0x00FF)



/*===========================================================================*/
/* memory map WDOG */
/*===========================================================================*/



#define WATCHDOG_REG                         (0x50003100) /* Watchdog timer register. */
#define WATCHDOG_REG_RESET                   (0x000000FF)

/*=============================*/
struct __WATCHDOG_REG
/*=============================*/
{
    volatile uint16_t BITFLD_WDOG_VAL                         : 8;
    volatile uint16_t BITFLD_WDOG_VAL_NEG                     : 1;
    volatile uint16_t BITFLD_WDOG_WEN                         : 7;
};
#define WDOG_VAL                             (0x00FF)
#define WDOG_VAL_NEG                         (0x0100)
#define WDOG_WEN                             (0xFE00)



#define WATCHDOG_CTRL_REG                    (0x50003102) /* Watchdog control register. */
#define WATCHDOG_CTRL_REG_RESET              (0x00000000)

/*=============================*/
struct __WATCHDOG_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_NMI_RST                          : 1;
    volatile uint16_t                                         : 1;
};
#define NMI_RST                              (0x0001)



/*===========================================================================*/
/* memory map WKUP */
/*===========================================================================*/



