dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/sdk/platform/include/da14585_586.h
#define WKUP_CTRL_REG                        (0x50000100) /* Control register for the wakeup counter */
#define WKUP_CTRL_REG_RESET                  (0x00000000)

/*=============================*/
struct __WKUP_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_WKUP_DEB_VALUE                   : 6;
    volatile uint16_t BITFLD_WKUP_SFT_KEYHIT                  : 1;
    volatile uint16_t BITFLD_WKUP_ENABLE_IRQ                  : 1;
    volatile uint16_t                                         : 6;
};
#define WKUP_DEB_VALUE                       (0x003F)
#define WKUP_SFT_KEYHIT                      (0x0040)
#define WKUP_ENABLE_IRQ                      (0x0080)



#define WKUP_COMPARE_REG                     (0x50000102) /* Number of events before wakeup interrupt */
#define WKUP_COMPARE_REG_RESET               (0x00000000)

/*=============================*/
struct __WKUP_COMPARE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_COMPARE                          : 8;
};
#define COMPARE                              (0x00FF)



#define WKUP_RESET_IRQ_REG                   (0x50000104) /* Reset wakeup interrupt */
#define WKUP_RESET_IRQ_REG_RESET             (0x00000000)

/*=============================*/
struct __WKUP_RESET_IRQ_REG
/*=============================*/
{
    volatile uint16_t BITFLD_WKUP_IRQ_RST                     : 16;
};
#define WKUP_IRQ_RST                         (0xFFFF)



#define WKUP_COUNTER_REG                     (0x50000106) /* Actual number of events of the wakeup counter */
#define WKUP_COUNTER_REG_RESET               (0x00000000)

/*=============================*/
struct __WKUP_COUNTER_REG
/*=============================*/
{
    volatile uint16_t BITFLD_EVENT_VALUE                      : 8;
};
#define EVENT_VALUE                          (0x00FF)



#define WKUP_RESET_CNTR_REG                  (0x50000108) /* Reset the event counter */
#define WKUP_RESET_CNTR_REG_RESET            (0x00000000)

/*=============================*/
struct __WKUP_RESET_CNTR_REG
/*=============================*/
{
    volatile uint16_t BITFLD_WKUP_CNTR_RST                    : 16;
};
#define WKUP_CNTR_RST                        (0xFFFF)



#define WKUP_SELECT_P0_REG                   (0x5000010A) /* Select which inputs from P0 port can trigger wkup counter */
#define WKUP_SELECT_P0_REG_RESET             (0x00000000)

/*=============================*/
struct __WKUP_SELECT_P0_REG
/*=============================*/
{
    volatile uint16_t BITFLD_WKUP_SELECT_P0                   : 8;
};
#define WKUP_SELECT_P0                       (0x00FF)



#define WKUP_SELECT_P1_REG                   (0x5000010C) /* Select which inputs from P1 port can trigger wkup counter */
#define WKUP_SELECT_P1_REG_RESET             (0x00000000)

/*=============================*/
struct __WKUP_SELECT_P1_REG
/*=============================*/
{
    volatile uint16_t BITFLD_WKUP_SELECT_P1                   : 6;
};
#define WKUP_SELECT_P1                       (0x003F)



#define WKUP_SELECT_P2_REG                   (0x5000010E) /* Select which inputs from P2 port can trigger wkup counter */
#define WKUP_SELECT_P2_REG_RESET             (0x00000000)

/*=============================*/
struct __WKUP_SELECT_P2_REG
/*=============================*/
{
    volatile uint16_t BITFLD_WKUP_SELECT_P2                   : 10;
};
#define WKUP_SELECT_P2                       (0x03FF)



#define WKUP_SELECT_P3_REG                   (0x50000110) /* Select which inputs from P3 port can trigger wkup counter */
#define WKUP_SELECT_P3_REG_RESET             (0x00000000)

/*=============================*/
struct __WKUP_SELECT_P3_REG
/*=============================*/
{
    volatile uint16_t BITFLD_WKUP_SELECT_P3                   : 8;
};
#define WKUP_SELECT_P3                       (0x00FF)



#define WKUP_POL_P0_REG                      (0x50000112) /* Select the sensitivity polarity for each P0 input */
#define WKUP_POL_P0_REG_RESET                (0x00000000)

/*=============================*/
struct __WKUP_POL_P0_REG
/*=============================*/
{
    volatile uint16_t BITFLD_WKUP_POL_P0                      : 8;
};
#define WKUP_POL_P0                          (0x00FF)



#define WKUP_POL_P1_REG                      (0x50000114) /* Select the sensitivity polarity for each P1 input */
#define WKUP_POL_P1_REG_RESET                (0x00000000)

/*=============================*/
struct __WKUP_POL_P1_REG
/*=============================*/
{
    volatile uint16_t BITFLD_WKUP_POL_P1                      : 6;
};
#define WKUP_POL_P1                          (0x003F)



#define WKUP_POL_P2_REG                      (0x50000116) /* Select the sensitivity polarity for each P2 input */
#define WKUP_POL_P2_REG_RESET                (0x00000000)

/*=============================*/
struct __WKUP_POL_P2_REG
/*=============================*/
{
    volatile uint16_t BITFLD_WKUP_POL_P2                      : 10;
};
#define WKUP_POL_P2                          (0x03FF)



#define WKUP_POL_P3_REG                      (0x50000118) /* Select the sensitivity polarity for each P3 input */
#define WKUP_POL_P3_REG_RESET                (0x00000000)

/*=============================*/
struct __WKUP_POL_P3_REG
/*=============================*/
{
    volatile uint16_t BITFLD_WKUP_POL_P3                      : 8;
};
#define WKUP_POL_P3                          (0x00FF)



/*===========================================================================*/
/* Test mode spec map */
/*===========================================================================*/



#define OTPC_TEST_REG                        (0x07F40030) /* Test register for the control/status of the SECDED logic */
#define OTPC_TEST_REG_RESET                  (0x00000000)

/*=============================*/
struct __OTPC_TEST_REG
/*=============================*/
{
    volatile uint32_t BITFLD_OTPC_SECDED_COR_DIS              : 1;
    volatile uint32_t                                         : 15;
    volatile uint32_t BITFLD_OTPC_SECDED_RAW_ECC              : 8;
    volatile uint32_t BITFLD_OTPC_SECDED_STAT                 : 2;
    volatile uint32_t BITFLD_OTPC_USED_RR                     : 1;
};
#define OTPC_SECDED_COR_DIS                  (0x0001)
#define OTPC_SECDED_RAW_ECC                  (0xFF0000)
#define OTPC_SECDED_STAT                     (0x3000000)
#define OTPC_USED_RR                         (0x4000000)



#define PATCH_VALID_REG                      (0x40080000) /* Validity Control Register */
#define PATCH_VALID_REG_RESET                (0x00000000)

/*=============================*/
struct __PATCH_VALID_REG
/*=============================*/
{
    volatile uint32_t BITFLD_PATCH_VALID                      : 22;
};
#define PATCH_VALID                          (0x3FFFFF)



#define PATCH_ADDR0_REG                      (0x40080020) /* Patch Address field */
#define PATCH_ADDR0_REG_RESET                (0x07F00000)

/*=============================*/
struct __PATCH_ADDR0_REG
/*=============================*/
{
    volatile uint32_t                                         : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_C                     : 16;
    volatile uint32_t                                         : 2;
    volatile uint32_t BITFLD_PATCH_ADDR_19                    : 1;
};
