dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/sdk/platform/include/da14585_586.h
#define PATCH_ADDR_C                         (0x1FFFE)
#define PATCH_ADDR_19                        (0x80000)



#define PATCH_ADDR1_REG                      (0x40080028) /* Patch Address field */
#define PATCH_ADDR1_REG_RESET                (0x07F00000)

/*=============================*/
struct __PATCH_ADDR1_REG
/*=============================*/
{
    volatile uint32_t                                         : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_C                     : 16;
    volatile uint32_t                                         : 2;
    volatile uint32_t BITFLD_PATCH_ADDR_19                    : 1;
};
#define PATCH_ADDR_C                         (0x1FFFE)
#define PATCH_ADDR_19                        (0x80000)



#define PATCH_ADDR2_REG                      (0x40080030) /* Patch Address field */
#define PATCH_ADDR2_REG_RESET                (0x07F00000)

/*=============================*/
struct __PATCH_ADDR2_REG
/*=============================*/
{
    volatile uint32_t                                         : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_C                     : 16;
    volatile uint32_t                                         : 2;
    volatile uint32_t BITFLD_PATCH_ADDR_19                    : 1;
};
#define PATCH_ADDR_C                         (0x1FFFE)
#define PATCH_ADDR_19                        (0x80000)



#define PATCH_ADDR3_REG                      (0x40080038) /* Patch Address field */
#define PATCH_ADDR3_REG_RESET                (0x07F00000)

/*=============================*/
struct __PATCH_ADDR3_REG
/*=============================*/
{
    volatile uint32_t                                         : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_C                     : 16;
    volatile uint32_t                                         : 2;
    volatile uint32_t BITFLD_PATCH_ADDR_19                    : 1;
};
#define PATCH_ADDR_C                         (0x1FFFE)
#define PATCH_ADDR_19                        (0x80000)



#define PATCH_ADDR4_REG                      (0x40080040) /* Patch Address field */
#define PATCH_ADDR4_REG_RESET                (0x07F00000)

/*=============================*/
struct __PATCH_ADDR4_REG
/*=============================*/
{
    volatile uint32_t                                         : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_C                     : 16;
    volatile uint32_t                                         : 2;
    volatile uint32_t BITFLD_PATCH_ADDR_19                    : 1;
};
#define PATCH_ADDR_C                         (0x1FFFE)
#define PATCH_ADDR_19                        (0x80000)



#define PATCH_ADDR5_REG                      (0x40080048) /* Patch Address field */
#define PATCH_ADDR5_REG_RESET                (0x07F00000)

/*=============================*/
struct __PATCH_ADDR5_REG
/*=============================*/
{
    volatile uint32_t                                         : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_C                     : 16;
    volatile uint32_t                                         : 2;
    volatile uint32_t BITFLD_PATCH_ADDR_19                    : 1;
};
#define PATCH_ADDR_C                         (0x1FFFE)
#define PATCH_ADDR_19                        (0x80000)



#define PATCH_ADDR6_REG                      (0x40080050) /* Patch Address field */
#define PATCH_ADDR6_REG_RESET                (0x07F00000)

/*=============================*/
struct __PATCH_ADDR6_REG
/*=============================*/
{
    volatile uint32_t                                         : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_C                     : 16;
    volatile uint32_t                                         : 2;
    volatile uint32_t BITFLD_PATCH_ADDR_19                    : 1;
};
#define PATCH_ADDR_C                         (0x1FFFE)
#define PATCH_ADDR_19                        (0x80000)



#define PATCH_ADDR7_REG                      (0x40080058) /* Patch Address field */
#define PATCH_ADDR7_REG_RESET                (0x07F00000)

/*=============================*/
struct __PATCH_ADDR7_REG
/*=============================*/
{
    volatile uint32_t                                         : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_C                     : 16;
    volatile uint32_t                                         : 2;
    volatile uint32_t BITFLD_PATCH_ADDR_19                    : 1;
};
#define PATCH_ADDR_C                         (0x1FFFE)
#define PATCH_ADDR_19                        (0x80000)



#define PATCH_ADDR8_REG                      (0x40080060) /* Patch Address field */
#define PATCH_ADDR8_REG_RESET                (0x07F00000)

/*=============================*/
struct __PATCH_ADDR8_REG
/*=============================*/
{
    volatile uint32_t                                         : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_C                     : 16;
    volatile uint32_t                                         : 2;
    volatile uint32_t BITFLD_PATCH_ADDR_19                    : 1;
};
#define PATCH_ADDR_C                         (0x1FFFE)
#define PATCH_ADDR_19                        (0x80000)



#define PATCH_ADDR9_REG                      (0x40080068) /* Patch Address field */
#define PATCH_ADDR9_REG_RESET                (0x07F00000)

/*=============================*/
struct __PATCH_ADDR9_REG
/*=============================*/
{
    volatile uint32_t                                         : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_C                     : 16;
    volatile uint32_t                                         : 2;
    volatile uint32_t BITFLD_PATCH_ADDR_19                    : 1;
};
#define PATCH_ADDR_C                         (0x1FFFE)
#define PATCH_ADDR_19                        (0x80000)



#define PATCH_ADDR10_REG                     (0x40080070) /* Patch Address field */
#define PATCH_ADDR10_REG_RESET               (0x07F00000)

/*=============================*/
struct __PATCH_ADDR10_REG
/*=============================*/
{
    volatile uint32_t                                         : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_C                     : 16;
    volatile uint32_t                                         : 2;
    volatile uint32_t BITFLD_PATCH_ADDR_19                    : 1;
};
