dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/sdk/platform/include/da14585_586.h
#define PATCH_DATA                           (0xFFFFFFFF)



#define PATCH_ADDR21_REG                     (0x400800C8) /* Patch Address field */
#define PATCH_ADDR21_REG_RESET               (0x07F00000)

/*=============================*/
struct __PATCH_ADDR21_REG
/*=============================*/
{
    volatile uint32_t                                         : 2;
    volatile uint32_t BITFLD_PATCH_ADDR_D                     : 15;
    volatile uint32_t                                         : 2;
    volatile uint32_t BITFLD_PATCH_ADDR_19                    : 1;
};
#define PATCH_ADDR_D                         (0x1FFFC)
#define PATCH_ADDR_19                        (0x80000)



#define PATCH_DATA21_REG                     (0x400800CC) /* Patch Data field */
#define PATCH_DATA21_REG_RESET               (0x00000000)

/*=============================*/
struct __PATCH_DATA21_REG
/*=============================*/
{
    volatile uint32_t BITFLD_PATCH_DATA                       : 32;
};
#define PATCH_DATA                           (0xFFFFFFFF)



#define STARTUP_STATUS_REG                   (0x5000002C) /* Startup timeout status */
#define STARTUP_STATUS_REG_RESET             (0x00000000)

/*=============================*/
struct __STARTUP_STATUS_REG
/*=============================*/
{
    volatile uint16_t BITFLD_SU_BANDGAP_NOK                   : 1;
    volatile uint16_t BITFLD_SU_VDCDC_NOK                     : 1;
    volatile uint16_t BITFLD_SU_BOOST_VBAT_NOK                : 1;
    volatile uint16_t BITFLD_SU_LDO_DIG_NOK                   : 1;
};
#define SU_BANDGAP_NOK                       (0x0001)
#define SU_VDCDC_NOK                         (0x0002)
#define SU_BOOST_VBAT_NOK                    (0x0004)
#define SU_LDO_DIG_NOK                       (0x0008)



#define RF_IO_CTRL1_REG                      (0x50000030) /* (in CRG) */
#define RF_IO_CTRL1_REG_RESET                (0x0000000F)

/*=============================*/
struct __RF_IO_CTRL1_REG
/*=============================*/
{
    volatile uint16_t BITFLD_RFIO_TRIM1_CAP                   : 8;
};
#define RFIO_TRIM1_CAP                       (0x00FF)



#define RF_LNA_CTRL1_REG                     (0x50000032) /* (in CRG) */
#define RF_LNA_CTRL1_REG_RESET               (0x0000024E)

/*=============================*/
struct __RF_LNA_CTRL1_REG
/*=============================*/
{
    volatile uint16_t BITFLD_LNA_TRIM_CD_LF                   : 6;
    volatile uint16_t BITFLD_LNA_TRIM_CD_HF                   : 6;
};
#define LNA_TRIM_CD_LF                       (0x003F)
#define LNA_TRIM_CD_HF                       (0x0FC0)



#define RF_LNA_CTRL2_REG                     (0x50000034) /* (in CRG) */
#define RF_LNA_CTRL2_REG_RESET               (0x00000226)

/*=============================*/
struct __RF_LNA_CTRL2_REG
/*=============================*/
{
    volatile uint16_t BITFLD_LNA_TRIM_GM_HI                   : 6;
    volatile uint16_t BITFLD_LNA_TRIM_GM_LO                   : 6;
};
#define LNA_TRIM_GM_HI                       (0x003F)
#define LNA_TRIM_GM_LO                       (0x0FC0)



#define RF_LNA_CTRL3_REG                     (0x50000036) /* (in CRG) */
#define RF_LNA_CTRL3_REG_RESET               (0x00000007)

/*=============================*/
struct __RF_LNA_CTRL3_REG
/*=============================*/
{
    volatile uint16_t BITFLD_LNA_TRIM_CGS                     : 5;
};
#define LNA_TRIM_CGS                         (0x001F)



#define RF_RSSI_COMP_CTRL_REG                (0x50000038) /* (in CRG) */
#define RF_RSSI_COMP_CTRL_REG_RESET          (0x00008777)

/*=============================*/
struct __RF_RSSI_COMP_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_RSSI_COMP01                      : 4;
    volatile uint16_t BITFLD_RSSI_COMP10                      : 4;
    volatile uint16_t BITFLD_RSSI_COMP11                      : 4;
    volatile uint16_t BITFLD_RSSI_COMP00                      : 4;
};
#define RSSI_COMP01                          (0x000F)
#define RSSI_COMP10                          (0x00F0)
#define RSSI_COMP11                          (0x0F00)
#define RSSI_COMP00                          (0xF000)



#define RF_VCO_CTRL_REG                      (0x5000003A) /*  */
#define RF_VCO_CTRL_REG_RESET                (0x00000001)

/*=============================*/
struct __RF_VCO_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_VCO_AMPL_SET                     : 4;
};
#define VCO_AMPL_SET                         (0x000F)



#define LDOS_DISABLE_REG                     (0x5000007E) /* Force off all LDOs */
#define LDOS_DISABLE_REG_RESET               (0x00000000)

/*=============================*/
struct __LDOS_DISABLE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_LDO_DIG_VBAT_DISABLE             : 1;
    volatile uint16_t BITFLD_LDO_DIG_VDCDC_DISABLE            : 1;
};
#define LDO_DIG_VBAT_DISABLE                 (0x0001)
#define LDO_DIG_VDCDC_DISABLE                (0x0002)



#define DCDC_CTRL_REG                        (0x50000080) /* DCDC control register */
#define DCDC_CTRL_REG_RESET                  (0x0000000C)

/*=============================*/
struct __DCDC_CTRL_REG
/*=============================*/
{
    volatile uint16_t                                         : 1;
    volatile uint16_t BITFLD_DCDC_VBAT1V_LEV                  : 3;
    volatile uint16_t                                         : 1;
    volatile uint16_t BITFLD_DCDC_MODE                        : 3;
    volatile uint16_t BITFLD_DCDC_DRIVE_NSW                   : 2;
    volatile uint16_t BITFLD_DCDC_DRIVE_PSW                   : 2;
    volatile uint16_t BITFLD_DCDC_DRIVE_OSW                   : 2;
    volatile uint16_t BITFLD_DCDC_TUNE                        : 2;
};
#define DCDC_VBAT1V_LEV                      (0x000E)
#define DCDC_MODE                            (0x00E0)
#define DCDC_DRIVE_NSW                       (0x0300)
#define DCDC_DRIVE_PSW                       (0x0C00)
#define DCDC_DRIVE_OSW                       (0x3000)
#define DCDC_TUNE                            (0xC000)



#define DCDC_CTRL2_REG                       (0x50000082) /* DCDC second control register */
#define DCDC_CTRL2_REG_RESET                 (0x00008C20)

/*=============================*/
struct __DCDC_CTRL2_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DCDC_AUTO_CAL                    : 3;
    volatile uint16_t BITFLD_DCDC_CUR_LIM                     : 4;
    volatile uint16_t BITFLD_DCDC_TON                         : 2;
    volatile uint16_t BITFLD_DCDC_VBAT3V_LEV                  : 3;
    volatile uint16_t BITFLD_DCDC_VOLT_LEV                    : 4;
};
#define DCDC_AUTO_CAL                        (0x0007)
#define DCDC_CUR_LIM                         (0x0078)
#define DCDC_TON                             (0x0180)
#define DCDC_VBAT3V_LEV                      (0x0E00)
#define DCDC_VOLT_LEV                        (0xF000)



#define DCDC_CTRL3_REG                       (0x50000084) /* DCDC thirth control register */
#define DCDC_CTRL3_REG_RESET                 (0x00000015)

/*=============================*/
struct __DCDC_CTRL3_REG
/*=============================*/
{
    volatile uint16_t BITFLD_BUCK_ENABLE                      : 1;
    volatile uint16_t BITFLD_DCDC_IDLE_CLK                    : 2;
    volatile uint16_t BITFLD_DCDC_TIMEOUT                     : 2;
};
#define BUCK_ENABLE                          (0x0001)
#define DCDC_IDLE_CLK                        (0x0006)
#define DCDC_TIMEOUT                         (0x0018)



#define DCDC_CAL1_REG                        (0x50000086) /* DCDC first calibration register */
#define DCDC_CAL1_REG_RESET                  (0x00000000)

/*=============================*/
struct __DCDC_CAL1_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DCDC_CAL1                        : 6;
};
#define DCDC_CAL1                            (0x003F)



#define DCDC_CAL2_REG                        (0x50000088) /* DCDC second calibration register */
#define DCDC_CAL2_REG_RESET                  (0x00000000)

/*=============================*/
struct __DCDC_CAL2_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DCDC_CAL2                        : 6;
};
#define DCDC_CAL2                            (0x003F)



#define DCDC_CAL3_REG                        (0x5000008A) /* DCDC thirth calibration register */
#define DCDC_CAL3_REG_RESET                  (0x00000000)

/*=============================*/
struct __DCDC_CAL3_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DCDC_CAL3                        : 6;
};
