dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/sdk/platform/include/da14585_586.h
#define DCDC_CAL3                            (0x003F)



#define RF_BMCW_REG                          (0x50002000) /*  */
#define RF_BMCW_REG_RESET                    (0x00000000)

/*=============================*/
struct __RF_BMCW_REG
/*=============================*/
{
    volatile uint16_t BITFLD_CN_WR                            : 8;
    volatile uint16_t BITFLD_CN_SEL                           : 1;
};
#define CN_WR                                (0x00FF)
#define CN_SEL                               (0x0100)



#define RF_OVERRULE_REG                      (0x50002020) /*  */
#define RF_OVERRULE_REG_RESET                (0x00000000)

/*=============================*/
struct __RF_OVERRULE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_TX_DIS_WR                        : 1;
    volatile uint16_t BITFLD_TX_EN_WR                         : 1;
    volatile uint16_t BITFLD_RX_DIS_WR                        : 1;
    volatile uint16_t BITFLD_RX_EN_WR                         : 1;
};
#define TX_DIS_WR                            (0x0001)
#define TX_EN_WR                             (0x0002)
#define RX_DIS_WR                            (0x0004)
#define RX_EN_WR                             (0x0008)



#define RF_DIAGIRQ01_REG                     (0x50002022) /* BLE/RF Diagnostic IRQ Control Register */
#define RF_DIAGIRQ01_REG_RESET               (0x00000000)

/*=============================*/
struct __RF_DIAGIRQ01_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DIAGIRQ_MASK_0                   : 1;
    volatile uint16_t BITFLD_DIAGIRQ_WSEL_0                   : 2;
    volatile uint16_t BITFLD_DIAGIRQ_BSEL_0                   : 3;
    volatile uint16_t BITFLD_DIAGIRQ_EDGE_0                   : 1;
    volatile uint16_t                                         : 1;
    volatile uint16_t BITFLD_DIAGIRQ_MASK_1                   : 1;
    volatile uint16_t BITFLD_DIAGIRQ_WSEL_1                   : 2;
    volatile uint16_t BITFLD_DIAGIRQ_BSEL_1                   : 3;
    volatile uint16_t BITFLD_DIAGIRQ_EDGE_1                   : 1;
};
#define DIAGIRQ_MASK_0                       (0x0001)
#define DIAGIRQ_WSEL_0                       (0x0006)
#define DIAGIRQ_BSEL_0                       (0x0038)
#define DIAGIRQ_EDGE_0                       (0x0040)
#define DIAGIRQ_MASK_1                       (0x0100)
#define DIAGIRQ_WSEL_1                       (0x0600)
#define DIAGIRQ_BSEL_1                       (0x3800)
#define DIAGIRQ_EDGE_1                       (0x4000)



#define RF_DIAGIRQ23_REG                     (0x50002024) /* BLE/RF Diagnostic IRQ Control Register */
#define RF_DIAGIRQ23_REG_RESET               (0x00000000)

/*=============================*/
struct __RF_DIAGIRQ23_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DIAGIRQ_MASK_2                   : 1;
    volatile uint16_t BITFLD_DIAGIRQ_WSEL_2                   : 2;
    volatile uint16_t BITFLD_DIAGIRQ_BSEL_2                   : 3;
    volatile uint16_t BITFLD_DIAGIRQ_EDGE_2                   : 1;
    volatile uint16_t                                         : 1;
    volatile uint16_t BITFLD_DIAGIRQ_MASK_3                   : 1;
    volatile uint16_t BITFLD_DIAGIRQ_WSEL_3                   : 2;
    volatile uint16_t BITFLD_DIAGIRQ_BSEL_3                   : 3;
    volatile uint16_t BITFLD_DIAGIRQ_EDGE_3                   : 1;
};
#define DIAGIRQ_MASK_2                       (0x0001)
#define DIAGIRQ_WSEL_2                       (0x0006)
#define DIAGIRQ_BSEL_2                       (0x0038)
#define DIAGIRQ_EDGE_2                       (0x0040)
#define DIAGIRQ_MASK_3                       (0x0100)
#define DIAGIRQ_WSEL_3                       (0x0600)
#define DIAGIRQ_BSEL_3                       (0x3800)
#define DIAGIRQ_EDGE_3                       (0x4000)



#define RF_DIAGIRQ_STAT_REG                  (0x50002026) /* BLE/RF Diagnostic IRQ Status Register */
#define RF_DIAGIRQ_STAT_REG_RESET            (0x00000000)

/*=============================*/
struct __RF_DIAGIRQ_STAT_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DIAGIRQ_STAT_0                   : 1;
    volatile uint16_t BITFLD_DIAGIRQ_STAT_1                   : 1;
    volatile uint16_t BITFLD_DIAGIRQ_STAT_2                   : 1;
    volatile uint16_t BITFLD_DIAGIRQ_STAT_3                   : 1;
};
#define DIAGIRQ_STAT_0                       (0x0001)
#define DIAGIRQ_STAT_1                       (0x0002)
#define DIAGIRQ_STAT_2                       (0x0004)
#define DIAGIRQ_STAT_3                       (0x0008)



#define RF_CALSTATE_REG                      (0x50002040) /*  */
#define RF_CALSTATE_REG_RESET                (0x00000000)

/*=============================*/
struct __RF_CALSTATE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_CALSTATE                         : 4;
};
#define CALSTATE                             (0x000F)



#define RF_CALCAP1_REG                       (0x50002060) /*  */
#define RF_CALCAP1_REG_RESET                 (0x0000502A)

/*=============================*/
struct __RF_CALCAP1_REG
/*=============================*/
{
    volatile uint16_t BITFLD_VCO_CALCAP_LOW                   : 16;
};
#define VCO_CALCAP_LOW                       (0xFFFF)



#define RF_CALCAP2_REG                       (0x50002062) /*  */
#define RF_CALCAP2_REG_RESET                 (0x00000001)

/*=============================*/
struct __RF_CALCAP2_REG
/*=============================*/
{
    volatile uint16_t BITFLD_VCO_CALCAP_HIGH                  : 2;
};
#define VCO_CALCAP_HIGH                      (0x0003)



#define RF_SCAN_FEEDBACK_REG                 (0x50002080) /*  */
#define RF_SCAN_FEEDBACK_REG_RESET           (0x00000000)

/*=============================*/
struct __RF_SCAN_FEEDBACK_REG
/*=============================*/
{
    volatile uint16_t BITFLD_LF_RES                           : 4;
    volatile uint16_t BITFLD_CP_CUR                           : 4;
};
#define LF_RES                               (0x000F)
#define CP_CUR                               (0x00F0)



#define RF_CAL_CTRL_REG                      (0x50002200) /*  */
#define RF_CAL_CTRL_REG_RESET                (0x00000000)

/*=============================*/
struct __RF_CAL_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_SO_CAL                           : 1;
    volatile uint16_t BITFLD_EO_CAL                           : 1;
    volatile uint16_t BITFLD_MGAIN_CAL_DIS                    : 1;
    volatile uint16_t BITFLD_IFF_CAL_DIS                      : 1;
    volatile uint16_t BITFLD_DC_OFFSET_CAL_DIS                : 1;
    volatile uint16_t BITFLD_VCO_CAL_DIS                      : 1;
};
#define SO_CAL                               (0x0001)
#define EO_CAL                               (0x0002)
#define MGAIN_CAL_DIS                        (0x0004)
#define IFF_CAL_DIS                          (0x0008)
#define DC_OFFSET_CAL_DIS                    (0x0010)
#define VCO_CAL_DIS                          (0x0020)



#define RF_REF_OSC_REG                       (0x50002202) /*  */
#define RF_REF_OSC_REG_RESET                 (0x000029AC)

/*=============================*/
struct __RF_REF_OSC_REG
/*=============================*/
{
    volatile uint16_t BITFLD_CNT_RO                           : 6;
    volatile uint16_t BITFLD_CNT_CLK                          : 9;
};
#define CNT_RO                               (0x003F)
#define CNT_CLK                              (0x7FC0)



#define RF_IRQ_CTRL_REG                      (0x50002204) /*  */
#define RF_IRQ_CTRL_REG_RESET                (0x00000001)

/*=============================*/
struct __RF_IRQ_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_EO_CAL_CLEAR                     : 1;
};
