dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/sdk/platform/include/da14585_586.h
#define EO_CAL_CLEAR                         (0x0001)



#define RF_IFF_RESULT_REG                    (0x50002300) /* Must be Retained */
#define RF_IFF_RESULT_REG_RESET              (0x00000010)

/*=============================*/
struct __RF_IFF_RESULT_REG
/*=============================*/
{
    volatile uint16_t BITFLD_IF_CAL_CAP_RD                    : 5;
};
#define IF_CAL_CAP_RD                        (0x001F)



#define RF_ADCI_DC_OFFSET_REG                (0x50002310) /* Must be Retained */
#define RF_ADCI_DC_OFFSET_REG_RESET          (0x00008080)

/*=============================*/
struct __RF_ADCI_DC_OFFSET_REG
/*=============================*/
{
    volatile uint16_t BITFLD_ADC_OFFP_I_RD                    : 8;
    volatile uint16_t BITFLD_ADC_OFFN_I_RD                    : 8;
};
#define ADC_OFFP_I_RD                        (0x00FF)
#define ADC_OFFN_I_RD                        (0xFF00)



#define RF_ADCQ_DC_OFFSET_REG                (0x50002312) /* Must be Retained */
#define RF_ADCQ_DC_OFFSET_REG_RESET          (0x00008080)

/*=============================*/
struct __RF_ADCQ_DC_OFFSET_REG
/*=============================*/
{
    volatile uint16_t BITFLD_ADC_OFFP_Q_RD                    : 8;
    volatile uint16_t BITFLD_ADC_OFFN_Q_RD                    : 8;
};
#define ADC_OFFP_Q_RD                        (0x00FF)
#define ADC_OFFN_Q_RD                        (0xFF00)



#define RF_DC_OFFSET_RESULT_REG              (0x50002314) /* Must be Retained */
#define RF_DC_OFFSET_RESULT_REG_RESET        (0x00000000)

/*=============================*/
struct __RF_DC_OFFSET_RESULT_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DCOFFSET_I_RD                    : 8;
    volatile uint16_t BITFLD_DCOFFSET_Q_RD                    : 8;
};
#define DCOFFSET_I_RD                        (0x00FF)
#define DCOFFSET_Q_RD                        (0xFF00)



#define RF_SYNTH_RESULT_REG                  (0x50002316) /* Must be Retained */
#define RF_SYNTH_RESULT_REG_RESET            (0x00000880)

/*=============================*/
struct __RF_SYNTH_RESULT_REG
/*=============================*/
{
    volatile uint16_t BITFLD_GAUSS_GAIN_CAL_RD                : 8;
    volatile uint16_t BITFLD_VCO_FREQTRIM_RD                  : 4;
};
#define GAUSS_GAIN_CAL_RD                    (0x00FF)
#define VCO_FREQTRIM_RD                      (0x0F00)



#define RF_SYNTH_RESULT2_REG                 (0x50002318) /* Must be Retained */
#define RF_SYNTH_RESULT2_REG_RESET           (0x00001490)

/*=============================*/
struct __RF_SYNTH_RESULT2_REG
/*=============================*/
{
    volatile uint16_t BITFLD_GAUSS_GAIN_RD                    : 8;
    volatile uint16_t BITFLD_CN_CAL_RD                        : 7;
};
#define GAUSS_GAIN_RD                        (0x00FF)
#define CN_CAL_RD                            (0x7F00)



#define RF_SYNTH_RESULT3_REG                 (0x5000231A) /*  */
#define RF_SYNTH_RESULT3_REG_RESET           (0x0000FFFF)

/*=============================*/
struct __RF_SYNTH_RESULT3_REG
/*=============================*/
{
    volatile uint16_t BITFLD_MDSTATE_RD                       : 16;
};
#define MDSTATE_RD                           (0xFFFF)



#define RF_CALTRIM_STEP1_REG                 (0x5000231C) /*  */
#define RF_CALTRIM_STEP1_REG_RESET           (0x00000000)

/*=============================*/
struct __RF_CALTRIM_STEP1_REG
/*=============================*/
{
    volatile uint16_t BITFLD_MDSTATE_RD                       : 16;
};
#define MDSTATE_RD                           (0xFFFF)



#define RF_CALTRIM_STEP2_REG                 (0x5000231E) /*  */
#define RF_CALTRIM_STEP2_REG_RESET           (0x00000000)

/*=============================*/
struct __RF_CALTRIM_STEP2_REG
/*=============================*/
{
    volatile uint16_t BITFLD_MDSTATE_RD                       : 16;
};
#define MDSTATE_RD                           (0xFFFF)



#define RF_CALTRIM_STEP3_REG                 (0x50002320) /*  */
#define RF_CALTRIM_STEP3_REG_RESET           (0x00000000)

/*=============================*/
struct __RF_CALTRIM_STEP3_REG
/*=============================*/
{
    volatile uint16_t BITFLD_MDSTATE_RD                       : 16;
};
#define MDSTATE_RD                           (0xFFFF)



#define RF_ENABLE_CONFIG1_REG                (0x50002400) /*  */
#define RF_ENABLE_CONFIG1_REG_RESET          (0x00000909)

/*=============================*/
struct __RF_ENABLE_CONFIG1_REG
/*=============================*/
{
    volatile uint16_t BITFLD_lna_core_en                      : 8;
    volatile uint16_t BITFLD_lna_ldo_en                       : 8;
};
#define lna_core_en                          (0x00FF)
#define lna_ldo_en                           (0xFF00)



#define RF_ENABLE_CONFIG2_REG                (0x50002402) /*  */
#define RF_ENABLE_CONFIG2_REG_RESET          (0x00000922)

/*=============================*/
struct __RF_ENABLE_CONFIG2_REG
/*=============================*/
{
    volatile uint16_t BITFLD_mix_ldo_en                       : 8;
    volatile uint16_t BITFLD_lna_cgm_en                       : 8;
};
#define mix_ldo_en                           (0x00FF)
#define lna_cgm_en                           (0xFF00)



#define RF_ENABLE_CONFIG3_REG                (0x50002404) /*  */
#define RF_ENABLE_CONFIG3_REG_RESET          (0x00002204)

/*=============================*/
struct __RF_ENABLE_CONFIG3_REG
/*=============================*/
{
    volatile uint16_t BITFLD_ifadc_ldo_en                     : 8;
    volatile uint16_t BITFLD_iff_ldo_en                       : 8;
};
#define ifadc_ldo_en                         (0x00FF)
#define iff_ldo_en                           (0xFF00)



#define RF_ENABLE_CONFIG4_REG                (0x50002406) /*  */
#define RF_ENABLE_CONFIG4_REG_RESET          (0x00002222)

/*=============================*/
struct __RF_ENABLE_CONFIG4_REG
/*=============================*/
{
    volatile uint16_t BITFLD_md_ldo_en                        : 8;
    volatile uint16_t BITFLD_vco_ldo_en                       : 8;
};
#define md_ldo_en                            (0x00FF)
#define vco_ldo_en                           (0xFF00)



#define RF_ENABLE_CONFIG5_REG                (0x50002408) /*  */
#define RF_ENABLE_CONFIG5_REG_RESET          (0x00002222)

/*=============================*/
struct __RF_ENABLE_CONFIG5_REG
/*=============================*/
{
    volatile uint16_t BITFLD_pa_ldo_en                        : 8;
    volatile uint16_t BITFLD_pfd_ldo_en                       : 8;
};
#define pa_ldo_en                            (0x00FF)
#define pfd_ldo_en                           (0xFF00)



#define RF_ENABLE_CONFIG6_REG                (0x5000240A) /*  */
#define RF_ENABLE_CONFIG6_REG_RESET          (0x00000022)

/*=============================*/
struct __RF_ENABLE_CONFIG6_REG
/*=============================*/
{
    volatile uint16_t BITFLD_vco_bias_en                      : 8;
    volatile uint16_t BITFLD_cp_switch_en                     : 8;
};
#define vco_bias_en                          (0x00FF)
#define cp_switch_en                         (0xFF00)



#define RF_ENABLE_CONFIG7_REG                (0x5000240C) /*  */
#define RF_ENABLE_CONFIG7_REG_RESET          (0x00003300)

/*=============================*/
struct __RF_ENABLE_CONFIG7_REG
/*=============================*/
{
    volatile uint16_t BITFLD_lna_ldo_zero                     : 8;
    volatile uint16_t BITFLD_cp_bias_en                       : 8;
};
#define lna_ldo_zero                         (0x00FF)
#define cp_bias_en                           (0xFF00)



