dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/sdk/platform/include/da14585_586.h
#define RF_ENABLE_CONFIG8_REG                (0x5000240E) /*  */
#define RF_ENABLE_CONFIG8_REG_RESET          (0x0000C0A0)

/*=============================*/
struct __RF_ENABLE_CONFIG8_REG
/*=============================*/
{
    volatile uint16_t BITFLD_pa_en                            : 8;
    volatile uint16_t BITFLD_pa_ramp_en                       : 8;
};
#define pa_en                                (0x00FF)
#define pa_ramp_en                           (0xFF00)



#define RF_ENABLE_CONFIG9_REG                (0x50002410) /*  */
#define RF_ENABLE_CONFIG9_REG_RESET          (0x00000204)

/*=============================*/
struct __RF_ENABLE_CONFIG9_REG
/*=============================*/
{
    volatile uint16_t BITFLD_iff_en                           : 8;
    volatile uint16_t BITFLD_mix_en                           : 8;
};
#define iff_en                               (0x00FF)
#define mix_en                               (0xFF00)



#define RF_ENABLE_CONFIG10_REG               (0x50002412) /*  */
#define RF_ENABLE_CONFIG10_REG_RESET         (0x00000422)

/*=============================*/
struct __RF_ENABLE_CONFIG10_REG
/*=============================*/
{
    volatile uint16_t BITFLD_vco_en                           : 8;
    volatile uint16_t BITFLD_adc_en                           : 8;
};
#define vco_en                               (0x00FF)
#define adc_en                               (0xFF00)



#define RF_ENABLE_CONFIG11_REG               (0x50002414) /*  */
#define RF_ENABLE_CONFIG11_REG_RESET         (0x00003333)

/*=============================*/
struct __RF_ENABLE_CONFIG11_REG
/*=============================*/
{
    volatile uint16_t BITFLD_cp_en                            : 8;
    volatile uint16_t BITFLD_md_lobuf_en                      : 8;
};
#define cp_en                                (0x00FF)
#define md_lobuf_en                          (0xFF00)



#define RF_ENABLE_CONFIG12_REG               (0x50002416) /*  */
#define RF_ENABLE_CONFIG12_REG_RESET         (0x00003330)

/*=============================*/
struct __RF_ENABLE_CONFIG12_REG
/*=============================*/
{
    volatile uint16_t BITFLD_gauss_en                         : 8;
    volatile uint16_t BITFLD_pfd_en                           : 8;
};
#define gauss_en                             (0x00FF)
#define pfd_en                               (0xFF00)



#define RF_ENABLE_CONFIG13_REG               (0x50002418) /*  */
#define RF_ENABLE_CONFIG13_REG_RESET         (0x0000D030)

/*=============================*/
struct __RF_ENABLE_CONFIG13_REG
/*=============================*/
{
    volatile uint16_t BITFLD_lobuf_pa_en                      : 8;
    volatile uint16_t BITFLD_rfio_en                          : 8;
};
#define lobuf_pa_en                          (0x00FF)
#define rfio_en                              (0xFF00)



#define RF_ENABLE_CONFIG14_REG               (0x5000241A) /*  */
#define RF_ENABLE_CONFIG14_REG_RESET         (0x00000433)

/*=============================*/
struct __RF_ENABLE_CONFIG14_REG
/*=============================*/
{
    volatile uint16_t BITFLD_div2_en                          : 8;
    volatile uint16_t BITFLD_lobuf_rxiq_en                    : 8;
};
#define div2_en                              (0x00FF)
#define lobuf_rxiq_en                        (0xFF00)



#define RF_ENABLE_CONFIG15_REG               (0x5000241C) /*  */
#define RF_ENABLE_CONFIG15_REG_RESET         (0x00005555)

/*=============================*/
struct __RF_ENABLE_CONFIG15_REG
/*=============================*/
{
    volatile uint16_t BITFLD_vco_bias_sh_open_en              : 8;
    volatile uint16_t BITFLD_cp_bias_sh_open                  : 8;
};
#define vco_bias_sh_open_en                  (0x00FF)
#define cp_bias_sh_open                      (0xFF00)



#define RF_ENABLE_CONFIG16_REG               (0x5000241E) /*  */
#define RF_ENABLE_CONFIG16_REG_RESET         (0x00000650)

/*=============================*/
struct __RF_ENABLE_CONFIG16_REG
/*=============================*/
{
    volatile uint16_t BITFLD_gauss_bias_sh_open_en            : 8;
    volatile uint16_t BITFLD_iff_bias_sh_open_en              : 8;
};
#define gauss_bias_sh_open_en                (0x00FF)
#define iff_bias_sh_open_en                  (0xFF00)



#define RF_ENABLE_CONFIG17_REG               (0x50002420) /*  */
#define RF_ENABLE_CONFIG17_REG_RESET         (0x00000633)

/*=============================*/
struct __RF_ENABLE_CONFIG17_REG
/*=============================*/
{
    volatile uint16_t BITFLD_plldig_en                        : 8;
    volatile uint16_t BITFLD_mix_bias_sh_open_en              : 8;
};
#define plldig_en                            (0x00FF)
#define mix_bias_sh_open_en                  (0xFF00)



#define RF_ENABLE_CONFIG18_REG               (0x50002422) /*  */
#define RF_ENABLE_CONFIG18_REG_RESET         (0x00007708)

/*=============================*/
struct __RF_ENABLE_CONFIG18_REG
/*=============================*/
{
    volatile uint16_t BITFLD_dem_en                           : 8;
    volatile uint16_t BITFLD_pllclosed_en                     : 8;
};
#define dem_en                               (0x00FF)
#define pllclosed_en                         (0xFF00)



#define RF_ENABLE_CONFIG19_REG               (0x50002424) /*  */
#define RF_ENABLE_CONFIG19_REG_RESET         (0x000011EE)

/*=============================*/
struct __RF_ENABLE_CONFIG19_REG
/*=============================*/
{
    volatile uint16_t BITFLD_cal_en                           : 8;
    volatile uint16_t BITFLD_ldo_zero_en                      : 8;
};
#define cal_en                               (0x00FF)
#define ldo_zero_en                          (0xFF00)



#define RF_ENABLE_CONFIG20_REG               (0x50002426) /*  */
#define RF_ENABLE_CONFIG20_REG_RESET         (0x00000022)

/*=============================*/
struct __RF_ENABLE_CONFIG20_REG
/*=============================*/
{
    volatile uint16_t BITFLD_ldo_rfio_en                      : 8;
    volatile uint16_t BITFLD_tdc_en                           : 8;
};
