dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/sdk/platform/include/da14585_586.h
#define SET_OFFSET                           (0x00FF)
#define RESET_OFFSET                         (0xFF00)



#define RF_CNTRL_TIMER_11_REG                (0x50002514) /*  */
#define RF_CNTRL_TIMER_11_REG_RESET          (0x00000230)

/*=============================*/
struct __RF_CNTRL_TIMER_11_REG
/*=============================*/
{
    volatile uint16_t BITFLD_SET_OFFSET                       : 8;
    volatile uint16_t BITFLD_RESET_OFFSET                     : 8;
};
#define SET_OFFSET                           (0x00FF)
#define RESET_OFFSET                         (0xFF00)



#define RF_CNTRL_TIMER_12_REG                (0x50002516) /*  */
#define RF_CNTRL_TIMER_12_REG_RESET          (0x00000239)

/*=============================*/
struct __RF_CNTRL_TIMER_12_REG
/*=============================*/
{
    volatile uint16_t BITFLD_SET_OFFSET                       : 8;
    volatile uint16_t BITFLD_RESET_OFFSET                     : 8;
};
#define SET_OFFSET                           (0x00FF)
#define RESET_OFFSET                         (0xFF00)



#define RF_CNTRL_TIMER_13_REG                (0x50002518) /*  */
#define RF_CNTRL_TIMER_13_REG_RESET          (0x00000145)

/*=============================*/
struct __RF_CNTRL_TIMER_13_REG
/*=============================*/
{
    volatile uint16_t BITFLD_SET_OFFSET                       : 8;
    volatile uint16_t BITFLD_RESET_OFFSET                     : 8;
};
#define SET_OFFSET                           (0x00FF)
#define RESET_OFFSET                         (0xFF00)



#define RF_CNTRL_TIMER_14_REG                (0x5000251A) /*  */
#define RF_CNTRL_TIMER_14_REG_RESET          (0x00002044)

/*=============================*/
struct __RF_CNTRL_TIMER_14_REG
/*=============================*/
{
    volatile uint16_t BITFLD_SET_OFFSET                       : 8;
    volatile uint16_t BITFLD_RESET_OFFSET                     : 8;
};
#define SET_OFFSET                           (0x00FF)
#define RESET_OFFSET                         (0xFF00)



#define BIAS_CTRL1_REG                       (0x50002600) /*  */
#define BIAS_CTRL1_REG_RESET                 (0x00008888)

/*=============================*/
struct __BIAS_CTRL1_REG
/*=============================*/
{
    volatile uint16_t BITFLD_MIX_BIAS_SET                     : 4;
    volatile uint16_t BITFLD_CP_BIAS_SET                      : 4;
    volatile uint16_t BITFLD_VCO_BIAS_SET                     : 4;
    volatile uint16_t BITFLD_IFF_BIAS_SET                     : 4;
};
#define MIX_BIAS_SET                         (0x000F)
#define CP_BIAS_SET                          (0x00F0)
#define VCO_BIAS_SET                         (0x0F00)
#define IFF_BIAS_SET                         (0xF000)



#define RF_SPARE1_REG                        (0x50002602) /*  */
#define RF_SPARE1_REG_RESET                  (0x00000000)

/*=============================*/
struct __RF_SPARE1_REG
/*=============================*/
{
    volatile uint16_t BITFLD_IFF_REAL_MODE                    : 1;
    volatile uint16_t BITFLD_DCOC_DAC_REF_CUR_CTRL            : 2;
    volatile uint16_t BITFLD_RF_SPARE1                        : 13;
};
#define IFF_REAL_MODE                        (0x0001)
#define DCOC_DAC_REF_CUR_CTRL                (0x0006)
#define RF_SPARE1                            (0xFFF8)



#define RF_MIXER_CTRL1_REG                   (0x50002810) /*  */
#define RF_MIXER_CTRL1_REG_RESET             (0x00000035)

/*=============================*/
struct __RF_MIXER_CTRL1_REG
/*=============================*/
{
    volatile uint16_t BITFLD_MIX_TRIM_GMBIAS                  : 4;
    volatile uint16_t BITFLD_MIX_TRIM_IBIAS                   : 4;
    volatile uint16_t BITFLD_MIX_TRIM_VCM                     : 4;
    volatile uint16_t BITFLD_MIX_SPARE                        : 4;
};
#define MIX_TRIM_GMBIAS                      (0x000F)
#define MIX_TRIM_IBIAS                       (0x00F0)
#define MIX_TRIM_VCM                         (0x0F00)
#define MIX_SPARE                            (0xF000)



#define RF_MIXER_CTRL2_REG                   (0x50002812) /*  */
#define RF_MIXER_CTRL2_REG_RESET             (0x0000000C)

/*=============================*/
struct __RF_MIXER_CTRL2_REG
/*=============================*/
{
    volatile uint16_t BITFLD_MIX_CAL_CAP_WR                   : 5;
    volatile uint16_t BITFLD_MIX_CAL_CAP_SEL                  : 1;
};
#define MIX_CAL_CAP_WR                       (0x001F)
#define MIX_CAL_CAP_SEL                      (0x0020)



#define RF_IFF_CTRL1_REG                     (0x50002820) /*  */
#define RF_IFF_CTRL1_REG_RESET               (0x0000000C)

/*=============================*/
struct __RF_IFF_CTRL1_REG
/*=============================*/
{
    volatile uint16_t BITFLD_IF_CAL_CAP_WR                    : 5;
    volatile uint16_t BITFLD_IF_CAL_CAP_SEL                   : 1;
    volatile uint16_t BITFLD_IF_MUTE                          : 1;
    volatile uint16_t BITFLD_RO_TO_PINS                       : 1;
    volatile uint16_t BITFLD_IFF_DCOC_DAC_DIS                 : 1;
};
#define IF_CAL_CAP_WR                        (0x001F)
#define IF_CAL_CAP_SEL                       (0x0020)
#define IF_MUTE                              (0x0040)
#define RO_TO_PINS                           (0x0080)
#define IFF_DCOC_DAC_DIS                     (0x0100)



#define RF_ADC_CTRL1_REG                     (0x50002830) /*  */
#define RF_ADC_CTRL1_REG_RESET               (0x00000000)

/*=============================*/
struct __RF_ADC_CTRL1_REG
/*=============================*/
{
    volatile uint16_t BITFLD_ADC_DC_OFFSET_SEL                : 1;
    volatile uint16_t                                         : 12;
    volatile uint16_t BITFLD_ADC_MUTE                         : 1;
    volatile uint16_t BITFLD_ADC_SIGN                         : 1;
};
#define ADC_DC_OFFSET_SEL                    (0x0001)
#define ADC_MUTE                             (0x2000)
#define ADC_SIGN                             (0x4000)



#define RF_ADC_CTRL2_REG                     (0x50002832) /*  */
#define RF_ADC_CTRL2_REG_RESET               (0x00000000)

/*=============================*/
struct __RF_ADC_CTRL2_REG
/*=============================*/
{
    volatile uint16_t BITFLD_ADC_OFFP_I_WR                    : 8;
    volatile uint16_t BITFLD_ADC_OFFN_I_WR                    : 8;
};
#define ADC_OFFP_I_WR                        (0x00FF)
#define ADC_OFFN_I_WR                        (0xFF00)



#define RF_ADC_CTRL3_REG                     (0x50002834) /*  */
#define RF_ADC_CTRL3_REG_RESET               (0x00000000)

/*=============================*/
struct __RF_ADC_CTRL3_REG
/*=============================*/
{
    volatile uint16_t BITFLD_ADC_OFFP_Q_WR                    : 8;
    volatile uint16_t BITFLD_ADC_OFFN_Q_WR                    : 8;
};
