dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/sdk/platform/include/da14585_586.h
#define ADC_OFFP_Q_WR                        (0x00FF)
#define ADC_OFFN_Q_WR                        (0xFF00)



#define RF_DEM_CTRL_REG                      (0x50002840) /*  */
#define RF_DEM_CTRL_REG_RESET                (0x00000059)

/*=============================*/
struct __RF_DEM_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_RXDATA_INV                       : 1;
    volatile uint16_t BITFLD_DEM_HSI_POL                      : 1;
    volatile uint16_t BITFLD_MATCH0101_TH                     : 4;
    volatile uint16_t BITFLD_EQUAL_EN                         : 1;
};
#define RXDATA_INV                           (0x0001)
#define DEM_HSI_POL                          (0x0002)
#define MATCH0101_TH                         (0x003C)
#define EQUAL_EN                             (0x0040)



#define RF_AGC_LUT_01_REG                    (0x50002850) /*  */
#define RF_AGC_LUT_01_REG_RESET              (0x00000100)

/*=============================*/
struct __RF_AGC_LUT_01_REG
/*=============================*/
{
    volatile uint16_t BITFLD_VGA2_GAIN0                       : 3;
    volatile uint16_t BITFLD_VGA1_GAIN0                       : 3;
    volatile uint16_t BITFLD_LNA_GAIN0                        : 2;
    volatile uint16_t BITFLD_VGA2_GAIN1                       : 3;
    volatile uint16_t BITFLD_VGA1_GAIN1                       : 3;
    volatile uint16_t BITFLD_LNA_GAIN1                        : 2;
};
#define VGA2_GAIN0                           (0x0007)
#define VGA1_GAIN0                           (0x0038)
#define LNA_GAIN0                            (0x00C0)
#define VGA2_GAIN1                           (0x0700)
#define VGA1_GAIN1                           (0x3800)
#define LNA_GAIN1                            (0xC000)



#define RF_AGC_LUT_23_REG                    (0x50002852) /*  */
#define RF_AGC_LUT_23_REG_RESET              (0x00004202)

/*=============================*/
struct __RF_AGC_LUT_23_REG
/*=============================*/
{
    volatile uint16_t BITFLD_VGA2_GAIN2                       : 3;
    volatile uint16_t BITFLD_VGA1_GAIN2                       : 3;
    volatile uint16_t BITFLD_LNA_GAIN2                        : 2;
    volatile uint16_t BITFLD_VGA2_GAIN3                       : 3;
    volatile uint16_t BITFLD_VGA1_GAIN3                       : 3;
    volatile uint16_t BITFLD_LNA_GAIN3                        : 2;
};
#define VGA2_GAIN2                           (0x0007)
#define VGA1_GAIN2                           (0x0038)
#define LNA_GAIN2                            (0x00C0)
#define VGA2_GAIN3                           (0x0700)
#define VGA1_GAIN3                           (0x3800)
#define LNA_GAIN3                            (0xC000)



#define RF_AGC_LUT_45_REG                    (0x50002854) /*  */
#define RF_AGC_LUT_45_REG_RESET              (0x00004B4A)

/*=============================*/
struct __RF_AGC_LUT_45_REG
/*=============================*/
{
    volatile uint16_t BITFLD_VGA2_GAIN4                       : 3;
    volatile uint16_t BITFLD_VGA1_GAIN4                       : 3;
    volatile uint16_t BITFLD_LNA_GAIN4                        : 2;
    volatile uint16_t BITFLD_VGA2_GAIN5                       : 3;
    volatile uint16_t BITFLD_VGA1_GAIN5                       : 3;
    volatile uint16_t BITFLD_LNA_GAIN5                        : 2;
};
#define VGA2_GAIN4                           (0x0007)
#define VGA1_GAIN4                           (0x0038)
#define LNA_GAIN4                            (0x00C0)
#define VGA2_GAIN5                           (0x0700)
#define VGA1_GAIN5                           (0x3800)
#define LNA_GAIN5                            (0xC000)



#define RF_AGC_LUT_67_REG                    (0x50002856) /*  */
#define RF_AGC_LUT_67_REG_RESET              (0x00005B53)

/*=============================*/
struct __RF_AGC_LUT_67_REG
/*=============================*/
{
    volatile uint16_t BITFLD_VGA2_GAIN6                       : 3;
    volatile uint16_t BITFLD_VGA1_GAIN6                       : 3;
    volatile uint16_t BITFLD_LNA_GAIN6                        : 2;
    volatile uint16_t BITFLD_VGA2_GAIN7                       : 3;
    volatile uint16_t BITFLD_VGA1_GAIN7                       : 3;
    volatile uint16_t BITFLD_LNA_GAIN7                        : 2;
};
#define VGA2_GAIN6                           (0x0007)
#define VGA1_GAIN6                           (0x0038)
#define LNA_GAIN6                            (0x00C0)
#define VGA2_GAIN7                           (0x0700)
#define VGA1_GAIN7                           (0x3800)
#define LNA_GAIN7                            (0xC000)



#define RF_AGC_LUT_89_REG                    (0x50002858) /*  */
#define RF_AGC_LUT_89_REG_RESET              (0x00006B63)

/*=============================*/
struct __RF_AGC_LUT_89_REG
/*=============================*/
{
    volatile uint16_t BITFLD_VGA2_GAIN8                       : 3;
    volatile uint16_t BITFLD_VGA1_GAIN8                       : 3;
    volatile uint16_t BITFLD_LNA_GAIN8                        : 2;
    volatile uint16_t BITFLD_VGA2_GAIN9                       : 3;
    volatile uint16_t BITFLD_VGA1_GAIN9                       : 3;
    volatile uint16_t BITFLD_LNA_GAIN9                        : 2;
};
#define VGA2_GAIN8                           (0x0007)
#define VGA1_GAIN8                           (0x0038)
#define LNA_GAIN8                            (0x00C0)
#define VGA2_GAIN9                           (0x0700)
#define VGA1_GAIN9                           (0x3800)
#define LNA_GAIN9                            (0xC000)



#define RF_AGC_CTRL1_REG                     (0x50002860) /*  */
#define RF_AGC_CTRL1_REG_RESET               (0x0000950D)

/*=============================*/
struct __RF_AGC_CTRL1_REG
/*=============================*/
{
    volatile uint16_t BITFLD_AGC_TH_LOW                       : 7;
    volatile uint16_t BITFLD_AGC_TH_HIGH                      : 7;
    volatile uint16_t BITFLD_AGC_MODE                         : 2;
};
#define AGC_TH_LOW                           (0x007F)
#define AGC_TH_HIGH                          (0x3F80)
#define AGC_MODE                             (0xC000)



