dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/sdk/platform/include/da14585_586.h
#define RF_AGC_CTRL2_REG                     (0x50002862) /*  */
#define RF_AGC_CTRL2_REG_RESET               (0x00000043)

/*=============================*/
struct __RF_AGC_CTRL2_REG
/*=============================*/
{
    volatile uint16_t BITFLD_RSSI_TH                          : 6;
    volatile uint16_t BITFLD_EN_FRZ_GAIN                      : 1;
    volatile uint16_t BITFLD_AGCSETTING_SEL                   : 1;
    volatile uint16_t BITFLD_AGCSETTING_WR                    : 4;
    volatile uint16_t BITFLD_SLOW_AGC                         : 1;
};
#define RSSI_TH                              (0x003F)
#define EN_FRZ_GAIN                          (0x0040)
#define AGCSETTING_SEL                       (0x0080)
#define AGCSETTING_WR                        (0x0F00)
#define SLOW_AGC                             (0x1000)



#define RF_AFC_CTRL_REG                      (0x50002864) /*  */
#define RF_AFC_CTRL_REG_RESET                (0x000000D5)

/*=============================*/
struct __RF_AFC_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_AFC_MODE                         : 4;
    volatile uint16_t BITFLD_POLE1                            : 2;
    volatile uint16_t BITFLD_POLE2                            : 2;
};
#define AFC_MODE                             (0x000F)
#define POLE1                                (0x0030)
#define POLE2                                (0x00C0)



#define RF_DC_OFFSET_CTRL1_REG               (0x50002866) /*  */
#define RF_DC_OFFSET_CTRL1_REG_RESET         (0x00008080)

/*=============================*/
struct __RF_DC_OFFSET_CTRL1_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DCOFFSET_I_WR                    : 8;
    volatile uint16_t BITFLD_DCOFFSET_Q_WR                    : 8;
};
#define DCOFFSET_I_WR                        (0x00FF)
#define DCOFFSET_Q_WR                        (0xFF00)



#define RF_DC_OFFSET_CTRL2_REG               (0x50002868) /*  */
#define RF_DC_OFFSET_CTRL2_REG_RESET         (0x000001D2)

/*=============================*/
struct __RF_DC_OFFSET_CTRL2_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DCOFFSET_SEL                     : 1;
    volatile uint16_t BITFLD_DCPARCAL_EN                      : 1;
    volatile uint16_t BITFLD_DCPOLE                           : 2;
    volatile uint16_t BITFLD_DCNSTEP                          : 3;
    volatile uint16_t BITFLD_DCNGAIN                          : 2;
};
#define DCOFFSET_SEL                         (0x0001)
#define DCPARCAL_EN                          (0x0002)
#define DCPOLE                               (0x000C)
#define DCNSTEP                              (0x0070)
#define DCNGAIN                              (0x0180)



#define RF_DC_OFFSET_CTRL3_REG               (0x5000286A) /*  */
#define RF_DC_OFFSET_CTRL3_REG_RESET         (0x0000DCE4)

/*=============================*/
struct __RF_DC_OFFSET_CTRL3_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DCBETA_I                         : 8;
    volatile uint16_t BITFLD_DCBETA_Q                         : 8;
};
#define DCBETA_I                             (0x00FF)
#define DCBETA_Q                             (0xFF00)



#define RF_DC_OFFSET_CTRL4_REG               (0x5000286C) /*  */
#define RF_DC_OFFSET_CTRL4_REG_RESET         (0x00009210)

/*=============================*/
struct __RF_DC_OFFSET_CTRL4_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DCAGCSETTING_FULL0               : 4;
    volatile uint16_t BITFLD_DCAGCSETTING_FULL1               : 4;
    volatile uint16_t BITFLD_DCAGCSETTING_FULL2               : 4;
    volatile uint16_t BITFLD_DCAGCSETTING_FULL3               : 4;
};
#define DCAGCSETTING_FULL0                   (0x000F)
#define DCAGCSETTING_FULL1                   (0x00F0)
#define DCAGCSETTING_FULL2                   (0x0F00)
#define DCAGCSETTING_FULL3                   (0xF000)



#define RF_RADIG_SPARE_REG                   (0x50002870) /*  */
#define RF_RADIG_SPARE_REG_RESET             (0x00000000)

/*=============================*/
struct __RF_RADIG_SPARE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_LSI_GLOBAL                       : 1;
    volatile uint16_t BITFLD_CC_TEST_MODE_1                   : 1;
    volatile uint16_t BITFLD_CC_TEST_MODE_2                   : 1;
    volatile uint16_t BITFLD_RADIG_SPARE                      : 13;
};
#define LSI_GLOBAL                           (0x0001)
#define CC_TEST_MODE_1                       (0x0002)
#define CC_TEST_MODE_2                       (0x0004)
#define RADIG_SPARE                          (0xFFF8)



#define RF_AGC_RESULT_REG                    (0x50002900) /*  */
#define RF_AGC_RESULT_REG_RESET              (0x00000000)

/*=============================*/
struct __RF_AGC_RESULT_REG
/*=============================*/
{
    volatile uint16_t BITFLD_AFC_RD                           : 8;
    volatile uint16_t BITFLD_AGCSETTING_RD                    : 4;
};
#define AFC_RD                               (0x00FF)
#define AGCSETTING_RD                        (0x0F00)



#define RF_RSSI_RESULT_REG                   (0x50002902) /*  */
#define RF_RSSI_RESULT_REG_RESET             (0x00000000)

/*=============================*/
struct __RF_RSSI_RESULT_REG
/*=============================*/
{
    volatile uint16_t BITFLD_RSSI_PH_RD                       : 6;
    volatile uint16_t BITFLD_RSSI_AVG_RD                      : 10;
};
#define RSSI_PH_RD                           (0x003F)
#define RSSI_AVG_RD                          (0xFFC0)



#define RF_PA_CTRL_REG                       (0x50002A00) /* Removed obsolete values of bits 10:7, pa_pw back to 4 */
#define RF_PA_CTRL_REG_RESET                 (0x00007853)

/*=============================*/
struct __RF_PA_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_PA_GAIN                          : 2;
    volatile uint16_t BITFLD_PA_PW                            : 3;
    volatile uint16_t BITFLD_PA_RAMPSPEED                     : 2;
    volatile uint16_t                                         : 4;
    volatile uint16_t BITFLD_LEVEL_LDO_RFPA                   : 4;
};
