dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/sdk/platform/include/da14585_586.h
#define PA_GAIN                              (0x0003)
#define PA_PW                                (0x001C)
#define PA_RAMPSPEED                         (0x0060)
#define LEVEL_LDO_RFPA                       (0x7800)



#define RF_SYNTH_CTRL1_REG                   (0x50002C00) /*  */
#define RF_SYNTH_CTRL1_REG_RESET             (0x00002962)

/*=============================*/
struct __RF_SYNTH_CTRL1_REG
/*=============================*/
{
    volatile uint16_t BITFLD_CHANNEL_ZERO                     : 12;
    volatile uint16_t BITFLD_SGN                              : 1;
    volatile uint16_t BITFLD_CS                               : 1;
    volatile uint16_t BITFLD_PLL_HSI_POL                      : 1;
};
#define CHANNEL_ZERO                         (0x0FFF)
#define SGN                                  (0x1000)
#define CS                                   (0x2000)
#define PLL_HSI_POL                          (0x4000)



#define RF_SYNTH_CTRL2_REG                   (0x50002C02) /*  */
#define RF_SYNTH_CTRL2_REG_RESET             (0x0000108B)

/*=============================*/
struct __RF_SYNTH_CTRL2_REG
/*=============================*/
{
    volatile uint16_t BITFLD_SD_ORDER_RX                      : 2;
    volatile uint16_t BITFLD_SD_ORDER_TX                      : 2;
    volatile uint16_t BITFLD_MODINDEX                         : 2;
    volatile uint16_t BITFLD_DELAY                            : 2;
    volatile uint16_t BITFLD_GAUSS_INV                        : 1;
    volatile uint16_t BITFLD_GAUSS_86                         : 1;
    volatile uint16_t BITFLD_TXDATA_INV                       : 1;
    volatile uint16_t BITFLD_EO_PACKET_DIS                    : 1;
    volatile uint16_t BITFLD_BT_SEL                           : 1;
};
#define SD_ORDER_RX                          (0x0003)
#define SD_ORDER_TX                          (0x000C)
#define MODINDEX                             (0x0030)
#define DELAY                                (0x00C0)
#define GAUSS_INV                            (0x0100)
#define GAUSS_86                             (0x0200)
#define TXDATA_INV                           (0x0400)
#define EO_PACKET_DIS                        (0x0800)
#define BT_SEL                               (0x1000)



#define RF_SYNTH_CTRL3_REG                   (0x50002C04) /*  */
#define RF_SYNTH_CTRL3_REG_RESET             (0x00000003)

/*=============================*/
struct __RF_SYNTH_CTRL3_REG
/*=============================*/
{
    volatile uint16_t BITFLD_MODVAL_WR                        : 14;
    volatile uint16_t BITFLD_MODVAL_SEL                       : 1;
};
#define MODVAL_WR                            (0x3FFF)
#define MODVAL_SEL                           (0x4000)



#define RF_VCOCAL_CTRL_REG                   (0x50002C06) /*  */
#define RF_VCOCAL_CTRL_REG_RESET             (0x000000C3)

/*=============================*/
struct __RF_VCOCAL_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_VCO_FREQTRIM_WR                  : 4;
    volatile uint16_t BITFLD_VCO_FREQTRIM_SEL                 : 1;
    volatile uint16_t BITFLD_VCO_FREQTRIM_OFF_SEL             : 1;
    volatile uint16_t BITFLD_VCOCAL_PERIOD                    : 2;
    volatile uint16_t BITFLD_VCOCAL_MD_STATE_DLY_SEL          : 1;
};
#define VCO_FREQTRIM_WR                      (0x000F)
#define VCO_FREQTRIM_SEL                     (0x0010)
#define VCO_FREQTRIM_OFF_SEL                 (0x0020)
#define VCOCAL_PERIOD                        (0x00C0)
#define VCOCAL_MD_STATE_DLY_SEL              (0x0100)



#define RF_MGAIN_CTRL_REG                    (0x50002C08) /*  */
#define RF_MGAIN_CTRL_REG_RESET              (0x00001403)

/*=============================*/
struct __RF_MGAIN_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_GAUSS_GAIN_WR                    : 8;
    volatile uint16_t BITFLD_GAUSS_GAIN_SEL                   : 1;
    volatile uint16_t BITFLD_MGAIN_DBL_TRANSMIT               : 1;
    volatile uint16_t BITFLD_MGAIN_CMP_INV                    : 1;
    volatile uint16_t BITFLD_MGAIN_AVER                       : 2;
};
#define GAUSS_GAIN_WR                        (0x00FF)
#define GAUSS_GAIN_SEL                       (0x0100)
#define MGAIN_DBL_TRANSMIT                   (0x0200)
#define MGAIN_CMP_INV                        (0x0400)
#define MGAIN_AVER                           (0x1800)



#define RF_MGAIN_CTRL2_REG                   (0x50002C0A) /*  */
#define RF_MGAIN_CTRL2_REG_RESET             (0x00000688)

/*=============================*/
struct __RF_MGAIN_CTRL2_REG
/*=============================*/
{
    volatile uint16_t BITFLD_MGAIN_TRANSMIT_LENGTH            : 7;
    volatile uint16_t BITFLD_KMOD_ALPHA                       : 6;
};
#define MGAIN_TRANSMIT_LENGTH                (0x007F)
#define KMOD_ALPHA                           (0x1F80)



#define RF_MGC_CTRL_REG                      (0x50002C10) /*  */
#define RF_MGC_CTRL_REG_RESET                (0x00000000)

/*=============================*/
struct __RF_MGC_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_MGC_GAIN_SET                     : 1;
    volatile uint16_t BITFLD_MGC_POLE_SW                      : 1;
    volatile uint16_t BITFLD_GAUSS_DAC_CTRL                   : 2;
};
#define MGC_GAIN_SET                         (0x0001)
#define MGC_POLE_SW                          (0x0002)
#define GAUSS_DAC_CTRL                       (0x000C)



#define RF_VCOVAR_CTRL_REG                   (0x50002C20) /*  */
#define RF_VCOVAR_CTRL_REG_RESET             (0x0000A492)

/*=============================*/
struct __RF_VCOVAR_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_TUNE_VAR_V0                      : 3;
    volatile uint16_t BITFLD_TUNE_VAR_V1                      : 3;
    volatile uint16_t BITFLD_TUNE_VAR_V2                      : 3;
    volatile uint16_t BITFLD_TUNE_VAR_V3                      : 3;
    volatile uint16_t BITFLD_MOD_VAR_V0                       : 2;
    volatile uint16_t BITFLD_MOD_VAR_V1                       : 2;
};
#define TUNE_VAR_V0                          (0x0007)
#define TUNE_VAR_V1                          (0x0038)
#define TUNE_VAR_V2                          (0x01C0)
#define TUNE_VAR_V3                          (0x0E00)
#define MOD_VAR_V0                           (0x3000)
#define MOD_VAR_V1                           (0xC000)



