dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/sdk/platform/include/da14585_586.h
#define RF_VCO_CALCAP_BIT14_REG              (0x50002C22) /*  */
#define RF_VCO_CALCAP_BIT14_REG_RESET        (0x0000D59D)

/*=============================*/
struct __RF_VCO_CALCAP_BIT14_REG
/*=============================*/
{
    volatile uint16_t BITFLD_VCO_CALCAP_BIT14                 : 16;
};
#define VCO_CALCAP_BIT14                     (0xFFFF)



#define RF_VCO_CALCAP_BIT15_REG              (0x50002C24) /*  */
#define RF_VCO_CALCAP_BIT15_REG_RESET        (0x00000000)

/*=============================*/
struct __RF_VCO_CALCAP_BIT15_REG
/*=============================*/
{
    volatile uint16_t BITFLD_VCO_CALCAP_BIT15                 : 16;
};
#define VCO_CALCAP_BIT15                     (0xFFFF)



#define RF_PFD_CTRL_REG                      (0x50002C40) /*  */
#define RF_PFD_CTRL_REG_RESET                (0x00000000)

/*=============================*/
struct __RF_PFD_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_FIXED_CUR_SET                    : 2;
    volatile uint16_t BITFLD_FIXED_CUR_EN                     : 1;
    volatile uint16_t BITFLD_PFD_POLARITY                     : 1;
};
#define FIXED_CUR_SET                        (0x0003)
#define FIXED_CUR_EN                         (0x0004)
#define PFD_POLARITY                         (0x0008)



#define RF_CP_CTRL_REG                       (0x50002C50) /*  */
#define RF_CP_CTRL_REG_RESET                 (0x00007F7F)

/*=============================*/
struct __RF_CP_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_CP_CUR_SET_RX                    : 4;
    volatile uint16_t BITFLD_CP_CUR_SET_TX                    : 4;
    volatile uint16_t BITFLD_CP_CUR_RX                        : 4;
    volatile uint16_t BITFLD_CP_CUR_TX                        : 4;
};
#define CP_CUR_SET_RX                        (0x000F)
#define CP_CUR_SET_TX                        (0x00F0)
#define CP_CUR_RX                            (0x0F00)
#define CP_CUR_TX                            (0xF000)



#define RF_LF_RES_CTRL_REG                   (0x50002C52) /* LF resistor setting */
#define RF_LF_RES_CTRL_REG_RESET             (0x00007F7F)

/*=============================*/
struct __RF_LF_RES_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_LF_RES_SET_RX                    : 4;
    volatile uint16_t BITFLD_LF_RES_SET_TX                    : 4;
    volatile uint16_t BITFLD_LF_RES_RX                        : 4;
    volatile uint16_t BITFLD_LF_RES_TX                        : 4;
};
#define LF_RES_SET_RX                        (0x000F)
#define LF_RES_SET_TX                        (0x00F0)
#define LF_RES_RX                            (0x0F00)
#define LF_RES_TX                            (0xF000)



#define RF_LF_CTRL_REG                       (0x50002C60) /*  */
#define RF_LF_CTRL_REG_RESET                 (0x00000050)

/*=============================*/
struct __RF_LF_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_LF_CAL_CAP_WR                    : 5;
    volatile uint16_t BITFLD_LF_CAL_CAP_SEL                   : 1;
    volatile uint16_t BITFLD_LF_SHORT_R4                      : 1;
    volatile uint16_t                                         : 1;
};
#define LF_CAL_CAP_WR                        (0x001F)
#define LF_CAL_CAP_SEL                       (0x0020)
#define LF_SHORT_R4                          (0x0040)



#define RF_TDC_CTRL_REG                      (0x50002C70) /* TDC settings */
#define RF_TDC_CTRL_REG_RESET                (0x00000000)

/*=============================*/
struct __RF_TDC_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_CTRL_FAST                        : 4;
    volatile uint16_t BITFLD_CTRL_SLOW                        : 4;
    volatile uint16_t BITFLD_CAL_PH_1                         : 1;
    volatile uint16_t BITFLD_CAL_PH_2                         : 1;
    volatile uint16_t BITFLD_REF_CTRL                         : 2;
    volatile uint16_t BITFLD_TDC_CONNECT                      : 1;
};
#define CTRL_FAST                            (0x000F)
#define CTRL_SLOW                            (0x00F0)
#define CAL_PH_1                             (0x0100)
#define CAL_PH_2                             (0x0200)
#define REF_CTRL                             (0x0C00)
#define TDC_CONNECT                          (0x1000)



#define SCAN_OBSERVE_REG                     (0x500030A0) /*  */
#define SCAN_OBSERVE_REG_RESET               (0x00000000)

/*=============================*/
struct __SCAN_OBSERVE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_SCAN_FEEDBACK_MUX                : 16;
};
#define SCAN_FEEDBACK_MUX                    (0xFFFF)



#define TEST_CTRL_REG                        (0x500030F0) /*  */
#define TEST_CTRL_REG_RESET                  (0x00000000)

/*=============================*/
struct __TEST_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_SHOW_CLOCKS                      : 1;
    volatile uint16_t BITFLD_ENABLE_RFPT                      : 1;
    volatile uint16_t BITFLD_SHOW_DC_STATE                    : 1;
    volatile uint16_t BITFLD_SHOW_DC_COMP                     : 1;
    volatile uint16_t BITFLD_XTAL16M_CAP_TEST_EN              : 1;
    volatile uint16_t BITFLD_SHOW_IF_RO                       : 1;
    volatile uint16_t BITFLD_PLL_TST_MODE                     : 1;
    volatile uint16_t                                         : 1;
};
#define SHOW_CLOCKS                          (0x0001)
#define ENABLE_RFPT                          (0x0002)
#define SHOW_DC_STATE                        (0x0004)
#define SHOW_DC_COMP                         (0x0008)
#define XTAL16M_CAP_TEST_EN                  (0x0010)
#define SHOW_IF_RO                           (0x0020)
#define PLL_TST_MODE                         (0x0040)



#define TEST_CTRL2_REG                       (0x500030F2) /*  */
#define TEST_CTRL2_REG_RESET                 (0x00000000)

/*=============================*/
struct __TEST_CTRL2_REG
/*=============================*/
{
    volatile uint16_t BITFLD_ANA_TESTMUX_CTRL                 : 4;
    volatile uint16_t                                         : 4;
    volatile uint16_t BITFLD_RF_IN_TESTMUX_CTRL               : 2;
};
