dialog-semiconductor/BLE_SDK6_examples/DA14531_USB_KIT_FW/6.0.11.989_USB_KIT/sdk/platform/include/da14585_586.h
#define ANA_TESTMUX_CTRL                     (0x000F)
#define RF_IN_TESTMUX_CTRL                   (0x0300)



#define TEST_CTRL3_REG                       (0x500030F4) /*  */
#define TEST_CTRL3_REG_RESET                 (0x00000000)

/*=============================*/
struct __TEST_CTRL3_REG
/*=============================*/
{
    volatile uint16_t BITFLD_RF_TEST_OUT_SEL                  : 6;
    volatile uint16_t                                         : 2;
    volatile uint16_t BITFLD_RF_TEST_OUT_PARAM                : 8;
};
#define RF_TEST_OUT_SEL                      (0x003F)
#define RF_TEST_OUT_PARAM                    (0xFF00)



#define TEST_CTRL4_REG                       (0x500030F6) /*  */
#define TEST_CTRL4_REG_RESET                 (0x00000000)

/*=============================*/
struct __TEST_CTRL4_REG
/*=============================*/
{
    volatile uint16_t BITFLD_RF_TEST_IN_SEL                   : 3;
    volatile uint16_t                                         : 5;
    volatile uint16_t BITFLD_RF_TEST_IN_PARAM                 : 8;
};
#define RF_TEST_IN_SEL                       (0x0007)
#define RF_TEST_IN_PARAM                     (0xFF00)



#define TEST_CTRL5_REG                       (0x500030F8) /*  */
#define TEST_CTRL5_REG_RESET                 (0x00000000)

/*=============================*/
struct __TEST_CTRL5_REG
/*=============================*/
{
    volatile uint16_t BITFLD_TEST_VDD                         : 1;
    volatile uint16_t BITFLD_TEST_OTP_VDD                     : 1;
    volatile uint16_t BITFLD_TEST_OTP_OTA                     : 1;
    volatile uint16_t BITFLD_TEST_OTP_VSS                     : 1;
    volatile uint16_t                                         : 4;
    volatile uint16_t BITFLD_TEST_STRUCT                      : 4;
    volatile uint16_t BITFLD_DCDC_NSW                         : 1;
    volatile uint16_t BITFLD_DCDC_PSW                         : 1;
    volatile uint16_t BITFLD_DCDC_OUTSW                       : 1;
    volatile uint16_t BITFLD_DCDC_FORCE_IDLE                  : 1;
};
#define TEST_VDD                             (0x0001)
#define TEST_OTP_VDD                         (0x0002)
#define TEST_OTP_OTA                         (0x0004)
#define TEST_OTP_VSS                         (0x0008)
#define TEST_STRUCT                          (0x0F00)
#define DCDC_NSW                             (0x1000)
#define DCDC_PSW                             (0x2000)
#define DCDC_OUTSW                           (0x4000)
#define DCDC_FORCE_IDLE                      (0x8000)



#define BIST_CTRL_REG                        (0x500030FA) /*  */
#define BIST_CTRL_REG_RESET                  (0x000006C0)

/*=============================*/
struct __BIST_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_RAM_BIST_CONFIG                  : 2;
    volatile uint16_t BITFLD_ROMBIST_ENABLE                   : 1;
    volatile uint16_t BITFLD_SYSRAM12_BIST_ENABLE             : 1;
    volatile uint16_t BITFLD_SHOW_BIST                        : 1;
    volatile uint16_t BITFLD_ROM_BIST_BUSY                    : 1;
    volatile uint16_t BITFLD_SYSRAM34_BIST_LINE_FAIL          : 1;
    volatile uint16_t BITFLD_SYSRAM34_BIST_FAIL               : 1;
    volatile uint16_t BITFLD_SYSRAM34_BIST_BUSY               : 1;
    volatile uint16_t BITFLD_SYSRAM12_BIST_LINE_FAIL          : 1;
    volatile uint16_t BITFLD_SYSRAM12_BIST_FAIL               : 1;
    volatile uint16_t BITFLD_SYSRAM12_BIST_BUSY               : 1;
    volatile uint16_t BITFLD_RAM_BIST_PATTERN                 : 2;
    volatile uint16_t BITFLD_SYSRAM34_BIST_ENABLE             : 1;
};
#define RAM_BIST_CONFIG                      (0x0003)
#define ROMBIST_ENABLE                       (0x0004)
#define SYSRAM12_BIST_ENABLE                 (0x0008)
#define SHOW_BIST                            (0x0010)
#define ROM_BIST_BUSY                        (0x0020)
#define SYSRAM34_BIST_LINE_FAIL              (0x0040)
#define SYSRAM34_BIST_FAIL                   (0x0080)
#define SYSRAM34_BIST_BUSY                   (0x0100)
#define SYSRAM12_BIST_LINE_FAIL              (0x0200)
#define SYSRAM12_BIST_FAIL                   (0x0400)
#define SYSRAM12_BIST_BUSY                   (0x0800)
#define RAM_BIST_PATTERN                     (0x3000)
#define SYSRAM34_BIST_ENABLE                 (0x4000)



#define ROMBIST_RESULTL_REG                  (0x500030FC) /*  */
#define ROMBIST_RESULTL_REG_RESET            (0x00000000)

/*=============================*/
struct __ROMBIST_RESULTL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_ROMBIST_RESULTL                  : 16;
};
#define ROMBIST_RESULTL                      (0xFFFF)



#define ROMBIST_RESULTH_REG                  (0x500030FE) /*  */
#define ROMBIST_RESULTH_REG_RESET            (0x00000000)

/*=============================*/
struct __ROMBIST_RESULTH_REG
/*=============================*/
{
    volatile uint16_t BITFLD_ROMBIST_RESULTH                  : 16;
};
#define ROMBIST_RESULTH                      (0xFFFF)



#define CHIP_CONFIG1_REG                     (0x50003205) /* Chip configuration register 1. */
#define CHIP_CONFIG1_REG_RESET               (0x00000020)

/*=============================*/
struct __CHIP_CONFIG1_REG
/*=============================*/
{
    volatile uint8_t  BITFLD_CHIP_CONFIG1                     : 8;
};
#define CHIP_CONFIG1                         (0x00FF)



#define CHIP_CONFIG2_REG                     (0x50003206) /* Chip configuration register 2. */
#define CHIP_CONFIG2_REG_RESET               (0x00000020)

/*=============================*/
struct __CHIP_CONFIG2_REG
/*=============================*/
{
    volatile uint8_t  BITFLD_CHIP_CONFIG2                     : 8;
};
#define CHIP_CONFIG2                         (0x00FF)



#define CHIP_CONFIG3_REG                     (0x50003207) /* Chip configuration register 3. */
#define CHIP_CONFIG3_REG_RESET               (0x00000020)

/*=============================*/
struct __CHIP_CONFIG3_REG
/*=============================*/
{
    volatile uint8_t  BITFLD_CHIP_CONFIG3                     : 8;
};
